{
    "BIO103":{
        "CourseTitle":"Introduction to Biotechnology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Gene therapy, genetic modification, cloning, stem cells, and vaccines are covered in this course. Lectures and four supplemental laboratory activities use modern equipment and techniques to illustrate core concepts which class discussions relate to health, society, and public policy. Not for Biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO113":{
        "CourseTitle":"General Ecology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of the principles of ecology in the context of finding solutions to local, national, and global environmental problems. Not for Biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO114":{
        "CourseTitle":"Dinosaur Paleontology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A study of paleontology that includes evolution of dinosaurs, their classification\nsystem, a study of the important dinosaur families, dinosaur behavior, ecology,\ncurrent controversies, hot topics and the KT extinction. Dinosaur paleontology will also cover the excavation of dinosaurs and the colorful history of the 'dinosaur hunters.' This course will emphasize the science and research involved in studying dinosaurs. Using dinosaurs as a vehicle, students will be exposed to the scientific method of inquiry and will leave this course with a better understanding on how to evaluate science in the real world. Not for Biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO115":{
        "CourseTitle":"Evolution and Society",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the historical and theoretical aspects of evolutionary biology, and also considers the implications of evolution for current social and public issues. The course examines both the original Darwinian and Modern Synthetic arguments for evolution by natural selection, how to differentiate scientific and non-scientific theories, and how historical sciences are practiced by scientists. Evolution is the key to understanding much of biology and influences a number of issues that we as citizens will have to consider in coming years. In particular, the evolutionary perspective and its implications for the development of humans and other social systems, the advent of agriculture, and its integral role in human health are considered. Not for Biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO201":{
        "CourseTitle":"Fundamentals of Biology: Organisms to Ecosystems",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the major concepts in evolution, ecology, and biodiversity at the genetic, organismal, community, and ecosystem levels. Topics are presented in relation to five overall themes: Nature and Process of Science, Evolution, Information Flow, Systems, and Structure-Function. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "BIO202":{
        "CourseTitle":"Fundamentals of Biology: Molecular and Cellular Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE129",
                "CHE131"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The fundamentals of cell biology, biochemistry, and genetics. The biochemical and molecular bases of cell structure, energy metabolism, gene regulation, heredity, and development in living organisms from bacteria to man are discussed. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "BIO203":{
        "CourseTitle":"Fundamentals of Biology: Cellular and Organ Physiology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE129",
                "CHE131"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "MAT125",
                "AMS151"
            ]
        ],
        "Description":"The fundamentals of cell and organ physiology in mammalian and non-mammalian organisms. The structure and function of cell membranes and the physiology of cell to cell signaling, cellular respiration, and homeostasis of organs and organisms are examined with an emphasis on the comparative physiology of vertebrates and invertebrates. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "BIO204":{
        "CourseTitle":"Fundamentals of Scientific Inquiry in the Biological Sciences I",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE129",
                "CHE131"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "CHE152",
                "BIO201",
                "BIO202",
                "BIO203"
            ]
        ],
        "Description":"First course in the foundational laboratory sequence for all biology students, and students in related fields.  Students will experience the laboratory process, research process, a wide range of laboratory tools, methods, skills, learn to read and write scientific presentations, and collaborate in formal inquiry. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information. This course includes assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458.",
        "spring":1,
        "fall":1
    },
    "BIO205":{
        "CourseTitle":"Fundamentals of Scientific Inquiry in the Biological Sciences IIA",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "BIO204"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO201",
                "BIO202",
                "BIO203"
            ]
        ],
        "Description":"Second course in the foundational laboratory sequence for all biology students, and students in related fields.  Students will experience the laboratory process, research process, a wide range of laboratory tools, methods, skills, learn to read and write scientific presentations, and collaborate in formal inquiry. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so. Not for credit in addition to BIO 207. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO207":{
        "CourseTitle":"Fundamentals of Scientific Inquiry in the Biological Sciences IIB",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "BIO204"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO201",
                "BIO202",
                "BIO203"
            ]
        ],
        "Description":"An alternative to BIO 205, this course focuses on a relatively narrow range of current research topics but in greater depth. BIO 207 is the second course in the foundational laboratory sequence for all biology majors and students in related fields. Students will experience the laboratory process, research process, a wide range of laboratory tools, methods, and skills, learn to read and write scientific works, and collaborate in formal inquiry. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so. Not for credit in addition to BIO 205. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO208":{
        "CourseTitle":"Cells, Brains, Minds",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An interdisciplinary exploration and critique of neuroscience. The course will present biological, anthropological and philosophical perspectives on how nervous systems work and how brains evolve, develop and give rise to human and other minds. Not for Biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO211":{
        "CourseTitle":"Statistics and Data Analysis: A Conceptual Approach",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "MAT123"
            ]
        ],
        "Description":"A conceptually-focused introduction to probability and data analysis emphasizing statistical literacy and critical thinking. Topics will include probability, t-tests, chi-squared tests, correlation, regression, and Analysis of Variance, as well as special topics of interest to undergraduate Biology majors such as case-control studies and meta-analysis. This course includes a one-hour recitation in which students will do hands-on activities, discuss papers from the primary literature, and gain experience with data analysis. May\nnot be taken by students with credit for AMS 110, 310, 311, 412, EBH 230,  or  ECO 320.",
        "spring":1,
        "fall":1
    },
    "BIO231":{
        "CourseTitle":"Cannabis: History, Culture, Science & Medicinal Uses",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Provide a sound background in all aspects of cannabis, including the history of use worldwide, cannabis plant biology, the chemistry of cannabinoids and endocannabinoids, and the relationship to political, legal, and racism issues throughout history to the present. The purpose of this broad familiarization is to prepare students to contribute knowledgeably to the discussion and debate regarding the present and future uses of cannabis.",
        "spring":1,
        "fall":1
    },
    "BIO299":{
        "CourseTitle":"Advanced Microbiology for Nursing and Allied Health",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "BIO204"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course will include lectures, laboratory recitations, and laboratory sessions focused on fundamental clinical Microbiology techniques. The lectures will cover Bacteria, Viruses, Helminths, and medically important Protozoans. In the laboratory, students will learn basic and applied clinical microbiology methods, including microscopy; staining and quantitative analysis of bacteria; analysis of throat and urine cultures; and determination of sensitivity to various antimicrobial agents. Priority for this course will be given to allied health, pre-nursing, and pre-veterinary students. May not be used for credit towards either the Biology major or minor. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information. Formerly offered as BIO 266; not for credit in addition to BIO 266.",
        "spring":1,
        "fall":1
    },
    "BIO306":{
        "CourseTitle":"Principles of Virology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Covers the principles of virology, focusing mainly on animal and human viruses, but also including plant viruses and bacteriophage. Topics include the classification of viruses, virus entry, genome replication and assembly, and viral pathogenesis. Particular emphasis is placed on virus-host cell interactions and common features between different virus families. Recommended for those planning to attend medical school, graduate school or Veterinary college, or anyone who is interested in what viruses are and how they cause disease.",
        "spring":1,
        "fall":1
    },
    "BIO310":{
        "CourseTitle":"Cell Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "BIO203"
            ],
            [
                "CHE321",
                "CHE331",
                "CHE341"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The cell is studied as the unit of structure, biochemical activity, genetic control, and differentiation. The principles of biochemistry and genetics are applied to an understanding of nutrition, growth, and development.",
        "spring":1,
        "fall":1
    },
    "BIO312":{
        "CourseTitle":"Bioinformatics and Computational Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "BIO204"
            ],
            [
                "MAT125",
                "AMS151"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "AMS110",
                "BIO211"
            ]
        ],
        "Description":"This course uses computational methods to analyze current problems and solutions in molecular biology research. Students are exposed to algorithms and tools available for both single gene and larger scale genome research. Emphasis is on practical application. Laboratories allow students to apply their knowledge to real life molecular biology problems. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 312.",
        "spring":1,
        "fall":1
    },
    "BIO314":{
        "CourseTitle":"Cancer Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An examination of the biology of cancer. Emphasis is on molecular and cellular events, such as regulation of gene expression, genome maintenance, cell growth and death, differentiation, cell-cell recognition, signaling and homeostasis that are frequently disrupted in cancer. Recent advances in diagnosis and therapy will also be discussed.",
        "spring":1,
        "fall":1
    },
    "BIO315":{
        "CourseTitle":"Microbiology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO201"
            ]
        ],
        "Description":"The organization, structure, energetics, and reproduction of microorganisms. Interactions of bacteria and viruses are discussed. This course does not include a laboratory component. Not for credit in addition to HBM 320. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "BIO316":{
        "CourseTitle":"Molecular Immunology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "CHE322",
                "CHE326",
                "CHE332"
            ]
        ],
        "Description":"Structure, function, and organization of the immune response at the molecular and cellular levels. Molecular mechanisms of immunological responses to microorganisms and various disease states are explored.",
        "spring":1,
        "fall":1
    },
    "BIO317":{
        "CourseTitle":"Principles of Cellular Signaling",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202",
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Basic principles of cellular signaling and maintenance of cellular and organismic homeostasis through intra- and intercellular signaling mechanisms. The roles of membrane and nuclear receptors, second-messenger pathways and gene regulation in controlling diverse mammalian systems such as sensory physiology, organic metabolism, growth control, and neuronal development are discussed.",
        "spring":1,
        "fall":1
    },
    "BIO319":{
        "CourseTitle":"Landscape Ecology Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "AMS110",
                "BIO211"
            ],
            [
                "BIO351"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO201"
            ]
        ],
        "Description":"A computer lab course focusing on spatial concepts, methods, and tools for addressing ecological and environmental problems. The course will be based on fundamental concepts in ecology and environmental science and extend that knowledge, as well as teaching technical skills, including the use of geographic information systems (GIS) software, image processing, spatially explicit modeling, and spatial statistics. The lab exercises will introduce a variety of spatial approaches addressing problems in environmental protection, ecotoxicology, natural resource management, conservation biology, and wildlife management.",
        "spring":1,
        "fall":1
    },
    "BIO320":{
        "CourseTitle":"General Genetics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "MAT125",
                "AMS151",
                "MAT126"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Integrates classical and molecular approaches to the transmission and expression of biological information. Topics include: Mendelian and non-Mendelian inheritance; linkage analysis; population genetics; DNA replication, mutation and recombination; gene expression and its regulation; current genetic technology; developmental and cancer genetics, quantitative and complex traits, and relevant ethical issues. Cannot be taken for major credit with BIO 321 (applies to Biology majors Only). This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 320.",
        "spring":1,
        "fall":1
    },
    "BIO321":{
        "CourseTitle":"Ecological Genetics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO351"
            ]
        ],
        "Description":"An introduction to the concepts, research questions, and methods involved in modern ecological genetics. The goal of the course is to provide a broad conceptual framework and an introduction to basic quantitative methods for students planning to engage in empirical work in conservation, management, ecology, and evolutionary biology. The course will cover basic Mendelian genetics, meiosis, and mating systems, standard population genetics methods for describing variation within and between populations, basic quantitative genetics, methods for molecular marker genotyping, informatic and genomic concepts, and organism-specific methods and case studies. Cannot be taken for major credit with BIO 320 (applies to Biology majors only). This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 321.",
        "spring":1,
        "fall":1
    },
    "BIO325":{
        "CourseTitle":"Animal Development",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An overview of animal embryonic development, emphasizing molecular mechanisms regulating embryonic growth and differentiation. General areas to be discussed include: molecular basis of human birth defects, stem cells, identification of developmental genes, establishing polarity in Drosophila and vertebrates, regulation of cell differentiation, morphogenesis and organ development, development of cancer.",
        "spring":1,
        "fall":1
    },
    "BIO327":{
        "CourseTitle":"Developmental Genetics Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO325"
            ],
            [
                "BIO205",
                "BIO207"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO320",
                "BIO321",
                "EBH302"
            ]
        ],
        "Description":"Exploration of the fundamental concepts in developmental biology and genetics through a combination of classical and modern molecular genetic approaches. Experiments are conducted using C. elegans and Nematostella, two important animal models for research in developmental biology and genetics. Students gain hands-on experience with the approaches used to investigate processes that control embryonic development on these two model systems, including the use of modern molecular methods for examining the regulation of gene expression during development. Exposure to the genetic approaches that are available in the C. elegans system will include participation in a genetic screen. This course includes assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 327. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO328":{
        "CourseTitle":"Mammalian Physiology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO203"
            ],
            [
                "CHE132",
                "CHE152",
                "CHE331"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A continuation of the fundamental principles of cellular and organ physiology introduced in BIO 203. The subject matter includes advanced topics covering the origins of membrane potentials, describing properties of synaptic transmission, identifying the genetics and consequences of channelopathies in cellular and organ cardiac physiology, and advanced treatment of selected topics in endocrine, cardiac, respiratory, renal and nervous system physiology. The focus is on mammals in general and humans more particularly.  May not be taken for credit in addition to HBY 350.",
        "spring":1,
        "fall":1
    },
    "BIO332":{
        "CourseTitle":"Computational Modeling of Physiological Systems",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT127",
                "MAT132",
                "AMS161"
            ],
            [
                "BIO202",
                "BIO203",
                "CHE132",
                "CHE331",
                "PHY127",
                "PHY132"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduces students to the fundamental principles underlying computational modeling of complex physiological systems. A major focus of the course will be on the process by which a model of a biological system is developed. Students will be introduced to the mathematical methods required for the modeling of complex systems (including stochastic processes and both temporal and spatial dynamics) as well as to tools for computational simulation. Roughly one half of the class will focus on models for general cellular physiology, while the remaining half will focus on the development of higher-level models of a particular physiological system (for example, the neurobiological systems underlying learning). This course is offered as both AMS 332 and BIO 332 and is intended for STEM majors who have already completed the foundational courses in their major. Students who satisfy the pre-requisites but do not have a deeper background in some STEM field may find the class very challenging and should ask the instructor for guidance before registering.",
        "spring":1,
        "fall":1
    },
    "BIO334":{
        "CourseTitle":"Principles of Neurobiology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The ionic basis of nerve potentials, the physiology of synapses, sense organs and effectors, and the integrative action of the nervous system are discussed.",
        "spring":1,
        "fall":1
    },
    "BIO335":{
        "CourseTitle":"Neurobiology Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO203"
            ],
            [
                "BIO205"
            ],
            [
                "PHY122",
                "PHY127",
                "PHY132"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A laboratory course in physiology with a focus on neuromuscular function. Topics include acquisition and analysis of electrophysiological data; ion channels, electrical excitability and action potentials; synaptic transmission and muscular contraction; development of physiological functions; central control of movement; sensory function and behavior; cardiac function and regulation; and ethical and political issues of physiological relevance. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 335. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO336":{
        "CourseTitle":"Conservation Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO320",
                "BIO321"
            ],
            [
                "BIO351"
            ]
        ],
        "Description":"Society and individual lives are increasingly affected by environmental degradation at different scales. From the decline of local fisheries to global climate change, multiple crises threaten the biodiversity and ecosystems that sustain us humans. This course introduces the scientific foundations of conservation biology, along with examples from real-world conservation. The course reviews the biological concepts that underlie conservation including habitat requirements, population dynamics, biogeography, and population genetics. Analysis of case studies on the effects of human activities on biological diversity and ecosystem services will be used to explore the interdisciplinary nature of the practice of conservation. This course will prepare students for careers in environmental sciences and ecology. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 336.",
        "spring":1,
        "fall":1
    },
    "BIO337":{
        "CourseTitle":"Neurotransmission and Neuromodulation: Implications for Brain Function",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Exploration of fundamental concepts of neurotransmission and neuromodulation of synaptic transmission. The subject matter includes an overview of the basic principles of neurotransmission and of the neuromodulatory systems in the brain. The involvement of these systems in behavior and neurological disorders is emphasized. We will discuss how specific neurological disorders can be investigated experimentally and how experimental results can contribute to understanding and treating these disorders.",
        "spring":1,
        "fall":1
    },
    "BIO338":{
        "CourseTitle":"From Synapse to Circuit: Self-organization of the Brain",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO203",
                "CHE132",
                "CHE331",
                "PHY122",
                "BIO334"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Exploration of basic neural and synaptic mechanisms and the operation of representative brain circuits, using both theoretical approaches and experimental evidence. Particular attention is given to Hebb's Rule, its cellular basis, its consequences for circuit selforganization, and its limits. A solid background in a mathematical, physical, or biological science is desirable, but most relevant background material is covered in the course.",
        "spring":1,
        "fall":1
    },
    "BIO339":{
        "CourseTitle":"Neurobiology of Disease",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202",
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the molecular events that underlie the normal function of the nervous system, with a focus on the origins of neuronal diseases including neurodevelopmental disorders (e.g. autism, intellectual disability), neurodegenerative diseases (e.g. Parkinson's, Alzheimer's) and neuro-immune disorders (e.g. Multiple sclerosis). Molecular and genetic approaches for the study of these disorders as well as therapeutic approaches and ethical aspects are discussed.",
        "spring":1,
        "fall":1
    },
    "BIO341":{
        "CourseTitle":"Plant Diversity",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ],
            [
                "BIO204"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the study of plants, especially green plants, including the origin and evolution of land plants. Topics include cellular structure and function, photosynthesis and respiration, gross anatomy, taxonomy and the diversity of organisms, plant ecology, agriculture. Three hours of lecture and one three-hour laboratory per week. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO342":{
        "CourseTitle":"Invertebrate Zoology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201",
                "MAR104"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO343"
            ]
        ],
        "Description":"Aspects of the diversity, comparative and functional morphology, natural history,\nevolution, and water-land transitions of invertebrate animals. Three hours of lecture per week. Must be taken concurrently with the Invertebrate Zoology Laboratory, BIO 343.",
        "spring":1,
        "fall":1
    },
    "BIO343":{
        "CourseTitle":"Invertebrate Zoology Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "BIO201",
                "MAR104"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO342"
            ]
        ],
        "Description":"Aspects of the diversity, comparative and functional morphology, natural history, evolution, and water-land transitions of invertebrate animals. One three-and-one-half hour laboratory per week plus a recitation.  Must be taken concurrently with the Invertebrate Zoology lecture, BIO 342. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information",
        "spring":1,
        "fall":1
    },
    "BIO344":{
        "CourseTitle":"Chordate Zoology",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to the diversity, natural history, and evolution of chordates, emphasizing the living vertebrates. Three hours of lecture or discussion and one three-hour laboratory per week. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 344. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO347":{
        "CourseTitle":"Introduction to Neural Computation",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT126",
                "MAT132",
                "AMS161"
            ],
            [
                "BIO211",
                "AMS110",
                "AMS310"
            ],
            [
                "BIO202",
                "BIO203",
                "CHE132",
                "CHE331",
                "PHY127",
                "PHY132",
                "MAT127"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A broad introduction to neural computation. This course will discuss what counts as 'computation' and in what sense the brain computes, how it computes, and whether those computations look anything like those performed by digital computers. These ideas and concepts will be introduced through examples of computation in the brain, including the neural bases of sensory perception, decision making, learning and memory, and motor control. Students will learn through in-class demonstrations and activities, as well as homework assignments that give students the opportunity to analyze real neural recordings relevant to each of the topic modules.",
        "spring":1,
        "fall":1
    },
    "BIO348":{
        "CourseTitle":"Diversity and Evolution of Reptiles and Amphibians",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The course will survey the diversity and natural history of the major groups of reptiles and amphibians, including snakes, lizards, turtles, crocodilians, frogs, and salamanders. Extinct groups (such as dinosaurs and pterosaurs) will also be covered. Furthermore, the course will showcase how studies of reptiles and amphibians have increased our general understanding of evolution and ecology, and will illustrate how diverse aspects of organismal biology (such as physiology, ecology, behavior, morphology) evolve and are interconnected.",
        "spring":1,
        "fall":1
    },
    "BIO350":{
        "CourseTitle":"Darwinian Medicine",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The ecology and evolution of disease, including evolution of human resistance to infection by pathogens, pathogen evolution in response to natural and technological defenses, and the ecological context of disease. Evolutionary phenomena are treated from molecular, organismal, population, and environmental perspectives.",
        "spring":1,
        "fall":1
    },
    "BIO351":{
        "CourseTitle":"Ecology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An examination of the interactions of living organisms with their physical and biological environments. Attention is given to population dynamics, the interactions among organisms, the structure and function of biological communities, the evolution of organisms and their interactions, spatial relationships and scale, and patterns and explanations for biodiversity and its loss.",
        "spring":1,
        "fall":1
    },
    "BIO352":{
        "CourseTitle":"Ecology Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO205",
                "BIO207"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO351"
            ]
        ],
        "Description":"Stresses the collection, analysis, and interpretation of ecological data, mostly in terrestrial settings. Laboratory and field exercises demonstrate the operation of general ecological principles in specific populations and communities. One lecture, one three-hour field trip or laboratory, and one hour of recitation per week. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology major. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 352. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO353":{
        "CourseTitle":"Marine Ecology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201",
                "MAR104",
                "BIO343"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of biotic responses to ecological challenges in different marine realms. Controls of diversity and trophic structure in the marine ecosystem, historical aspects of marine realms, productivity in the oceans, plankton, soft-bottom communities, intertidal habitats, coral reefs, deep-sea environments, and effects of pollution in the ocean are discussed. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 353.",
        "spring":1,
        "fall":1
    },
    "BIO354":{
        "CourseTitle":"Evolution",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO320"
            ]
        ],
        "Description":"A detailed discussion of the mechanisms of evolution, focusing on the ways in which genetic changes in populations lead to adaptation, speciation, and historical patterns of evolutionary change. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 354.",
        "spring":1,
        "fall":1
    },
    "BIO356":{
        "CourseTitle":"Population and Community Ecology Computer Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "BIO201",
                "BIO202",
                "BIO203"
            ],
            [
                "BIO204"
            ],
            [
                "MAT126"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A computer laboratory course where population and community ecology concepts are applied to real-world datasets and simulated data. Laboratories are based on free interactive software. Techniques for data wrangling and computer simulation of ecological models are emphasized.",
        "spring":1,
        "fall":1
    },
    "BIO358":{
        "CourseTitle":"Biology and Human Social and Sexual Behavior",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "ANP101",
                "BIO115",
                "BIO201",
                "BIO202",
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Major features of human social and sexual behavior are examined from a biological perspective.  Insights from ethology, evolutionary biology, and neurobiology are synthesized into a picture of human nature and behavior.  Implications of this picture for human sexual and social behavior are considered. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "BIO361":{
        "CourseTitle":"Biochemistry I",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO202"
            ],
            [
                "CHE322"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"First course of an advanced two-semester study of the major chemical constituents of the cell, including carbohydrates, lipids, and proteins. Emphasis is on enzyme structure, enzyme kinetics, reaction mechanisms, and metabolic pathways.",
        "spring":1,
        "fall":1
    },
    "BIO362":{
        "CourseTitle":"Biochemistry II",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO361",
                "CHE346"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Second course of an advanced two-semester study of biochemistry. BIO 362 is the Molecular Biochemistry section that treats nucleic acid structure, replication, and transcription, both in vivo and in vitro. The machinery and regulation of prokaryotic and eukaryotic protein synthesis is also covered, including amino acid activation; transfer RNA; ribosomes; the genetic code; and peptide chain initiation, elongation, and termination.",
        "spring":1,
        "fall":1
    },
    "BIO364":{
        "CourseTitle":"Laboratory Techniques in Cancer Biology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO205",
                "BIO207"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO314"
            ]
        ],
        "Description":"This course will introduce contemporary concepts of cancer initiation, progression, metastasis and therapy. The lectures and recitations will include discussions of appropriate review articles, textbook readings and research articles. In the laboratory, students will be introduced to and recapitulate key techniques used in the selected research articles. This course will require significant work on computers outside of class time (more than 3 hours per week). This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 364. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO365":{
        "CourseTitle":"Biochemistry Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO205",
                "BIO207"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO310",
                "BIO361"
            ]
        ],
        "Description":"This course consists of lecture and laboratory components. In the lecture portion of the course, students are introduced to modern technologies used to study proteins, nucleic acids, and other macromolecules as well as the application of these methods in contemporary research. Scientists at Stony Brook University will be invited to present and discuss with students the application of these methods in their current research and in assigned primary publications. The laboratory component is divided into four modules designed to teach basic biochemistry techniques as well as develop the skills of problem solving and analytical thinking. The laboratory modules include: (1) classical biochemistry techniques to extract and quantify cellular constituents such as chlorophyll, DNA, RNA and proteins from Euglena gracilis, (2) characterize bovine catalase enzyme kinetics and design experiments to measure student's blood catalase levels, (3) purification of a His-tagged protein and the evaluation of its purity using SDS gel electrophoresis and western blot analysis, and (4) students will amplify and sequence their mitochondrial control region DNA and compare their sequence to known sequences dating back to the earliest hominids. For each set of experiments the students will need to write a lab report describing their own work and discuss their results in the light of previously published research. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 365. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO366":{
        "CourseTitle":"Molecular Microbiology Laboratory",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "BIO205"
            ],
            [
                "BIO315"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course will include both lectures as well laboratory sessions focused on conventional and contemporary Molecular Microbiological techniques. The lectures will cover a variety of microorganisms; Bacteria, Fungi, Viruses, and Protozoans based on textbook readings and current research articles. In the laboratory, students will learn fundamental and applied microbiological methods, biochemical and DNA profiling of microorganisms, and the molecular basis of physiological processes used for the identification of unknown bacteria. This course will serve as an upper-division elective for BIO majors. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology  and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 366. The course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO367":{
        "CourseTitle":"Molecular Diversity Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ],
            [
                "BIO205",
                "BIO207"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO320",
                "BIO321",
                "BIO351",
                "BIO354"
            ]
        ],
        "Description":"Hands-on experience with methods to detect and analyze molecular (DNA, RNA, protein) variation to study ecology, adaptation, and evolutionary history using natural populations of Drosophila, plankton, and other locally available species. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 367. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO368":{
        "CourseTitle":"Food Microbiology",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "BIO315"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course is designed to give students an understanding of subtle relationship\nbetween food borne microorganisms and human health. Course will cover various topics focused on microorganisms involved in food processing, preservation, spoilage, and methods to control their growth in food items. The lectures will be presented based on textbook readings and current research articles and cover in depth the role of food borne microorganisms in illness as well health promotion. This course will serve as an upper-division elective for BIO majors.",
        "spring":1,
        "fall":1
    },
    "BIO369":{
        "CourseTitle":"Animal Nutrition",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO203"
            ]
        ],
        "Description":"Nutrient classes, requirements, use, and sources will be explored. Gastrointestinal anatomy and feeding standards for small, large, and exotic animal species during reproduction, growth, maintenance, and in disease are evaluated in the context of mechanisms underlying differences in nutritional requirements. Finally, laws, labeling, and marketing of animal feed will be examined. This course satisfies the prerequisite of an upper division animal nutrition course for AVMA-accredited veterinary schools.",
        "spring":1,
        "fall":1
    },
    "BIO371":{
        "CourseTitle":"Restoration of Aquatic Ecosystems",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "BIO202"
            ],
            [
                "BIO204",
                "BIO353"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A field and laboratory course designed to introduce students to field methods in assessing the long-term effects of pollution and restoration of aquatic and marsh systems. Students will work in teams to collaborate on measuring exchange of pollutants between a restored Superfund site and adjacent areas, the long-term effects of ecological restoration, habitat assessment, aquatic community structure in restored and adjacent systems, and long-term evolutionary effects on aquatic pollutants. Other restoration systems will be compared. This course has an associated fee.  Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO383":{
        "CourseTitle":"Paleobiology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Fossils are a fundamental component of the rock record and provide the only direct evidence of past life on Earth. They provide basic information for both geologists and biologists on topics like climate change, tectonic plate motion, the evolution of biological novelty, the nature of mass extinction, and the history of biodiversity. They are also increasingly used to establish natural baselines to inform modern conservation efforts. This course represents a process and systems-based study of the marine and terrestrial fossil record. The course will focus on preservation and taphonomy, macroevolution, biomechanics, paleoecology, ecomorphology, biogeography, and the extinction of biotas in the context of the environmental history of Earth. The course format consists of a mix of lecture, discussion, and lab activities. This course will additionally take advantage of connections with the Turkana Basin Institute here at Stony Brook University, where researchers play an important role in understanding the evolution and paleoecology of East African ecosystems, including that of our own ancestors. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO384":{
        "CourseTitle":"Intermediate Statistics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO211",
                "AMS110",
                "EBH230"
            ],
            [
                "BIO201",
                "BIO202",
                "BIO203"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This is an intermediate-level course in biostatistics, emphasizing the use of statistics as a tool to answer scientific questions in ecology and other biological disciplines. Topics from introductory statistics courses will be explored in greater depth using the R software package. Additional advanced topics will include experimental design, meta-analysis, general linear models, complex regression, multifactor analysis of variance, and multivariate analyses. Within each topic, the assumptions of statistical tests will be examined, as well as methods to cope with violations of those assumptions. Students will develop skills in graphical display of quantitative data, exploratory data analysis, and critical evaluation of published statistical analyses. Students will use R software throughout the course to develop their coding skills.",
        "spring":1,
        "fall":1
    },
    "BIO385":{
        "CourseTitle":"Plant Ecology",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO351"
            ]
        ],
        "Description":"Basic ecological principles as applied to the biology of individual plants, plant populations, communities, and ecosystems in relation to their environments. Examples from Long Island pine barrens, tropical rain forests, beaches, deserts, and other plant communities are studied. Examination of the connections between human societies and plant communities, which are rapidly being altered or destroyed worldwide. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 385.",
        "spring":1,
        "fall":1
    },
    "BIO386":{
        "CourseTitle":"Ecosystem Ecology and the Global Environment",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "BIO201"
            ],
            [
                "CHE129",
                "CHE131",
                "CHE141",
                "CHE152",
                "MAR104"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Ecosystem ecology with an emphasis on biogeochemical cycling in oceans and on land, as well as on biosphere-atmosphere interactions. Topics include earth system processes such as climate and atmospheric composition, the hydrological cycle, cycling of chemicals such as nutrients and metals in the oceans, the soil cycle, and the fate and transport of materials in the atmosphere. Natural and perturbed systems are discussed. This course routinely offers an opportunity to satisfy the Stony Brook Curriculum WRTD and Upper Division Writing Requirements for the Biology and Biochemistry majors. Students who intend to use the writing assignment in this course to satisfy these requirements must register for BIO 459 when they register for BIO 386. This course is offered as both BIO 386 and ENS 311.",
        "spring":1,
        "fall":1
    },
    "BIO444":{
        "CourseTitle":"Experiential Learning",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "WRT102"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course is designed for students who engage in a substantial, structured experiential learning activity in conjunction with another class. Experiential learning occurs when knowledge acquired through formal learning and past experience are applied to a \"real-world\" setting or problem to create new knowledge through a process of reflection, critical analysis, feedback and synthesis. Beyond-the-classroom experiences that support experiential learning may include: service learning, mentored research, field work, or an internship.",
        "spring":1,
        "fall":1
    },
    "BIO446":{
        "CourseTitle":"Readings in Neurobiology and Physiology",
        "Career":"Undergraduate",
        "Credits":"1.00 - 2.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Tutorial readings in the biological sciences. These courses may be repeated, but not more than two credits may be used toward biology major requirements. Limit of one topic per semester.",
        "spring":1,
        "fall":1
    },
    "BIO447":{
        "CourseTitle":"Readings in Molecular, Cellular, and Developmental Biology",
        "Career":"Undergraduate",
        "Credits":"1.00 - 2.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Tutorial readings in the biological sciences. These courses may be repeated, but not more than two credits may be used toward biology major requirements. Limit of one topic per semester.",
        "spring":1,
        "fall":1
    },
    "BIO449":{
        "CourseTitle":"Readings in Ecology and Evolution",
        "Career":"Undergraduate",
        "Credits":"1.00 - 2.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Tutorial readings in the biological sciences. These courses may be repeated, but not more than two credits may be used toward biology major requirements. Limit of one topic per semester.",
        "spring":1,
        "fall":1
    },
    "BIO458":{
        "CourseTitle":"Speak Effectively Before an Audience",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "BIO204",
                "BIO311",
                "BIO327",
                "BIO486",
                "BIO487",
                "BIO488",
                "BIO489"
            ]
        ],
        "Description":"A zero credit course that may be taken in conjunction with any BIO course that provides an opportunity to achieve the learning outcomes of the Stony Brook Curriculum's SPK learning objective.",
        "spring":1,
        "fall":1
    },
    "BIO459":{
        "CourseTitle":"Write Effectively in Biology",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A zero credit course that is taken in the same semester as a 300- or 400-level BIO course that provides opportunity to achieve the learning outcomes of the Stony Brook Curriculum's WRTD learning objective. For information on approved co-requisite courses and the registration form for Biology and Biochemistry majors see: https:\/\/www.stonybrook.edu\/commcms\/biology\/advising\/BIO-459.php",
        "spring":1,
        "fall":1
    },
    "BIO475":{
        "CourseTitle":"Undergraduate Teaching Practicum in College Biology I",
        "Career":"Undergraduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Study of the literature, resources, and teaching strategies in a field of biology, coordinated with a supervised clinical experience in instruction. Not for major credit. Students may not serve as teaching assistants in the same course twice.",
        "spring":1,
        "fall":1
    },
    "BIO476":{
        "CourseTitle":"Undergraduate Teaching Practicum in College Biology II",
        "Career":"Undergraduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":[
            [
                "BIO475"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Study of the literature, resources, and teaching strategies in a field of biology, coordinated with a supervised clinical experience in instruction. The student should have different and\/or greater responsibilities as a Teaching Assistant if the course is not different from a prior teaching practicum experience. Not for BIO major or minor credit.",
        "spring":1,
        "fall":1
    },
    "BIO477":{
        "CourseTitle":"Undergraduate Teaching Practicum in College Biology III",
        "Career":"Undergraduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":[
            [
                "BIO476"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Study of the literature, resources, and teaching strategies in a field of biology, coordinated with a supervised practical experience in instruction. In the practical instructional experience, the Undergraduate Teaching Assistant works with guidance from a faculty sponsor to provide support to students in labs, recitations, conferences, tutorials, or demonstrations associated with a course being taught by the sponsor. The student should have different and\/or greater responsibilities as a Teaching Assistant if the course is not different from a prior teaching practicum experience. Not for BIO major or minor credit. May be repeated.",
        "spring":1,
        "fall":1
    },
    "BIO484":{
        "CourseTitle":"Research in Biology and Society",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students work under the supervision of a faculty member in developing an individual project that makes use of the knowledge and techniques acquired in previous courses. The student reports on the project in a format agreed upon with their faculty sponsor that allows reflection on learning outcomes. This course may be repeated, but no more than four credits of research may be used for Biology major requirements. With prior permission from the faculty sponsor, this course could include assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458, and\/or the SBC objective WRTD if co-registered for BIO 459.",
        "spring":1,
        "fall":1
    },
    "BIO486":{
        "CourseTitle":"Research in Neurobiology and Physiology",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students work under the supervision of a faculty member in developing an individual project that makes use of the knowledge and techniques acquired in previous courses. The student reports on the project in a format agreed upon with their faculty sponsor that allows reflection on learning outcomes. This course may be repeated, but no more than four credits of research may be used for Biology major requirements. With prior permission from the faculty sponsor, this course could include assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458 and\/or the SBC objective WRTD if co-registered for BIO 459.",
        "spring":1,
        "fall":1
    },
    "BIO487":{
        "CourseTitle":"Research in Molecular, Cellular, and Developmental Biology",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students work under the supervision of a faculty member in developing an individual project that makes use of the knowledge and techniques acquired in previous courses. The student reports on the project in a format agreed upon with their faculty sponsor that allows reflection on learning outcomes. This course may be repeated, but no more than four credits of research may be used for Biology major requirements. With prior permission from the faculty sponsor, this course could include assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458 and\/or the SBC objective WRTD if co-registered for BIO 459.",
        "spring":1,
        "fall":1
    },
    "BIO488":{
        "CourseTitle":"Internship in Biological Sciences",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students work under the supervision of a faculty member or approved professional sponsor to obtain a career-related experience in the life sciences. The student reports on the project in a format agreed upon with their sponsor that allows reflection on learning outcomes. Students must be accepted into an internship program before registering for credit. May be repeated up to a limit of 12 credits. Not for biology major credit.",
        "spring":1,
        "fall":1
    },
    "BIO489":{
        "CourseTitle":"Research in Ecology and Evolution",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students work under the supervision of a faculty member in developing an individual project that makes use of the knowledge and techniques acquired in previous courses. The student reports on the project in a format agreed upon with their faculty sponsor that allows reflection on learning outcomes. This course may be repeated, but no more than four credits of research may be used for Biology major requirements. With prior permission from the faculty sponsor, this course could include assignments that can be used to satisfy the SBC objective SPK if co-registered for BIO 458 and\/or the SBC objective WRTD if co-registered for BIO 459.",
        "spring":1,
        "fall":1
    },
    "BIO511":{
        "CourseTitle":"Topics in Biotechnology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the field of biotechnology.  The course will survey the history of the development of genetic engineering, methodologies used in biotechnology, applications of biotechnology in medicine, agriculture and manufacturing, and the implications of these technologies for society.  Intended for the students in the MAT Science and MALS programs.   This course has an associated fee. Please see www.stonybrook.edu\/course fees for more information. \nOffered Spring, 3 Credits, ABCF Grading",
        "spring":1,
        "fall":1
    },
    "BIO515":{
        "CourseTitle":"Current Topics in Microbiology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of microbiology with an emphasis on microbial ecology, the role of microbes in the biosphere and the methodology used to explore these areas.  The course is organized around two resources available online: Unseen Life on Earth: An Introduction to Microbiology, which was produced by The American Society for Microbiology (http:\/\/www.learner.org\/resources\/series121.html) and the New York State core curriculum for The Living Environment (http:\/\/www.p12.nysed.gov\/ciai\/mst\/sci\/ls.html) .  Intended for the students in the MAT Science and MALS programs.   This course has an associated fee. Please see www.stonybrook.edu\/course fees for more information.",
        "spring":1,
        "fall":1
    },
    "BIO520":{
        "CourseTitle":"Topics in Genetics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of genetics organized around a particular topic, including gene regulation, developmental genetics, cancer genetics, epigenetics with emphasis on areas with emerging new insight.  The methodology used to study these areas will also be explored.  Intended for students in the MAT Biology and PhD Science Education programs.\nOffered Fall, 3 Credits, ABCF Grading",
        "spring":1,
        "fall":1
    },
    "BIO521":{
        "CourseTitle":"Laboratory Science Curriculum Development",
        "Career":"Graduate",
        "Credits":"1.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Development of curriculum materials appropriate for a secondary school biology classroom.  Students may take this course in their second semester of the Master of Arts in Teaching Science program. \nOffered Fall and Spring, 3 Credits, ABCF Grading",
        "spring":1,
        "fall":1
    },
    "BIO542":{
        "CourseTitle":"Model Systems for the Living Environment",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to microbial model systems used in biological research such as yeast, nematodes and slime molds.  Particular attention will be given to using these systems in the classroom to illustrate key concepts in introductory biology.  Students will read and discuss research papers selected from the current scientific literature.  Topics to be covered include: life cycle, laboratory techniques and design of inquiry-based investigations.\nOffered Summer, 3 Credits, ABCF Grading",
        "spring":1,
        "fall":1
    },
    "BIO558":{
        "CourseTitle":"Biological Basis of Human Evolution and Behavior",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A exploration of biological theories of human evolution, properties, and behavior. We build an understanding of evolution of complex organisms by natural selection, followed by the emergence of humans as a uniquiely complex species. Scientific hypothesis formation and testing using the extensive multidisciplinary empirical record of the 1.8 million years of human history is developed throughout. Implications of human evolutionary biology for contemporary social and sexual behavior are also investigated.\nThis course is co-scheduled with BIO 558.\nFall, Spring, and Summer",
        "spring":1,
        "fall":1
    },
    "BIO600":{
        "CourseTitle":"Practicum in Teaching",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring":1,
        "fall":1
    },
    "BIO601":{
        "CourseTitle":"Practicum in Teaching",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring":1,
        "fall":1
    }
}