{
    "CHE115":{
        "CourseTitle":"Chemistry, Life, and Environment",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This survey course introduces chemical principles by emphasizing the role chemistry plays in everyday life, the natural environment, the built environment, energy production, and in processes leading to environmental degradation.  In addition, the role of chemistry in the development of alternative energy sources, remediation technologies, and eco-friendly products is discussed.  This course for non-science majors introduces chemical principles using mostly qualitative approaches rather than quantitative approaches.  Interactive tools and interactive visualization tools are extensively used to illustrate concepts, reactions, and processes. May not be taken by students with credit for CHE 129, CHE 131, or CHE 152. This course is offered as both CHE 115 and ENV 115.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE129":{
        "CourseTitle":"General Chemistry IA",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT123",
                "CHE130"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This is the initial course of the four-semester General-Chemistry\/Organic-Chemistry sequence CHE 129\/132\/321\/322. This sequence provides the necessary foundation for students who wish to pursue further coursework in chemistry. The General Chemistry Courses provide a broad introduction to the fundamental principles of chemistry, including substantial illustrative material drawn from the chemistry of inorganic, organic, and biochemical systems. The emphasis is on basic concepts, problem-solving, and factual material. Students will be placed into CHE 129 based on their performance in the Online Chemistry Placement and Preparation (OCPP) process. Specifically, CHE 129 is for students with chemistry knowledge above the required OCPP minimum but who do not meet the math corequisite of CHE 131. The level and content of CHE 129 match that of CHE 131, but since the corequisite differs, students must also attend a CHE 130 session each week. CHE 130 builds essential skills in information processing, critical and analytical thinking, quantitative reasoning, and problem solving. The CHE 129 four-semester sequence is inappropriate for students who satisfy the corequisites of CHE 131. It is also inappropriate for students who have completed an AP course in chemistry and received a score of 4 or 5; such students must enroll in CHE 152. Three lecture hours, one 80-minute workshop, and one CHE 130 session per week. CHE 129 may not be taken for credit in addition to CHE 131 or CHE 152. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE130":{
        "CourseTitle":"Problem Solving in General Chemistry",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "CHE129",
                "MAT123"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This course provides a structured environment for completing CHE 129 homework assignments and helping students develop the quantitative reasoning and problem solving skills needed in General Chemistry. Satisfactory\/Unsatifactory grading only. Grading is based on attendance and participation. Required for students taking CHE 129 along with MAT 123.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE131":{
        "CourseTitle":"General Chemistry IB",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT125"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This is the initial course in the four-semester General-Chemistry\/Organic-Chemistry sequence CHE 131\/132\/321\/322. This sequence provides the necessary foundation for students who wish to pursue further coursework in Chemistry. The General Chemistry courses provide a broad introduction to the fundamental principles of chemistry, including substantial illustrative material drawn from the chemistry of inorganic, organic, and biochemical systems. The emphasis is on basic concepts, problem-solving, and factual material. The principal topics covered are stoichiometry, the states of matter, chemical equilibrium and introductory thermodynamics, electrochemistry, chemical kinetics, electron structure and chemical bonding, and chemical periodicity. Students will be placed into CHE 131 based on their performance in an Online Chemistry Placement and Preparation (OCPP) process. The four-semester sequence is inappropriate for students who have completed an AP course in chemistry and received a score of 4 or 5; these students are placed into CHE 152. Three lecture hours and one 80-minute workshop per week. May not be taken for credit in addition to CHE 129 or CHE 152. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE132":{
        "CourseTitle":"General Chemistry II",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE129",
                "CHE131",
                "MAT125",
                "CHE129"
            ],
            [
                "MAT126"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A continuation of either CHE 129 or 131, introducing the fundamental principles of chemistry, including substantial illustrative material drawn from the chemistry of inorganic, organic, and biochemical systems. The principal topics covered are stoichiometry, the states of matter, chemical equilibrium and introductory thermodynamics, electrochemistry, chemical kinetics, electron structure and chemical bonding, and chemical periodicity. The sequence emphasizes basic concepts, problem solving, and factual material. It provides the necessary foundation for students who wish to pursue further coursework in chemistry.  Three lecture hours and one 80-minute workshop per week. May not be taken for credit in addition to CHE 152. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE133":{
        "CourseTitle":"General Chemistry Laboratory I",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "CHE129"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Designed to familiarize students with (1) some chemical and physical properties of substances, (2) techniques of quantitative chemistry, and (3) scientific methodology. Three hours of laboratory or related activity per week. CHE 133 and CHE 134 may not be taken for credit in addition to CHE 154. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE134":{
        "CourseTitle":"General Chemistry Laboratory II",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "CHE133",
                "CHE132"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Designed to familiarize students with (1) some chemical and physical properties of substances, (2) techniques of quantitative chemistry, and (3) scientific methodology. Three hours of laboratory or related activity per week. CHE 133 and CHE 134 may not be taken for credit in addition to CHE 154. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE152":{
        "CourseTitle":"Molecular Science I",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT131",
                "MAT125",
                "AMS151"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This is the initial course of the three-semester Molecular Science sequence CHE 152\/331\/332. The topics covered in CHE 152 include atomic and molecular structure, chemical bonding, thermodynamics, equilibrium and aqueous chemistry, electrochemistry, kinetics and basics of organic chemistry. Students will be placed into CHE 152 based on their performance in the Online Chemistry Placement and Preparation (OCPP) process or upon receipt of a score of 4 or 5 in AP chemistry. (Such students cannot enroll in any of the courses CHE 129\/130, 131, or 132). May not be taken for credit in addition to CHE 129, 131, or 132. Three lecture hours and one 80-minute workshop per week.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE154":{
        "CourseTitle":"Molecular Science Laboratory I",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE152"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Designed to familiarize students with chemical and physical properties of substances, techniques of quantitative chemistry, and aspects of scientific methodology. Four hours of lab per week. CHE 154 may not be taken for credit in addition to CHE 134. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE301":{
        "CourseTitle":"Physical Chemistry I",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE132"
            ],
            [
                "MAT132",
                "AMS161",
                "MAT203",
                "MAT211",
                "AMS210",
                "AMS261"
            ],
            [
                "PHY121"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This course is the first half of a two-semester overview of modern physical chemistry, introducing students to the quantitative study of chemical systems.  The fundamentals of thermodynamics from both macroscopic and microscopic standpoints are covered, with applications to chemical problems. May not be taken for credit by students who have completed CHE 312.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE302":{
        "CourseTitle":"Physical Chemistry II",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE301"
            ],
            [
                "MAT203",
                "MAT211",
                "AMS210",
                "AMS261",
                "PHY122",
                "PHY126"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Introduction to quantum theory and its application to the study of chemical bonding, molecular spectroscopy, statistical thermodynamics, chemical kinetics and molecular reaction dynamics.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE303":{
        "CourseTitle":"Solution Chemistry Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE134",
                "CHE154",
                "CHE301"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Quantitative techniques of solution chemistry. Measurement: accuracy and precision, analysis, computation, and reporting. Spectrophotometry. Solution equilibria and kinetics. Use of computers is introduced. Six hours of laboratory and discussion. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE304":{
        "CourseTitle":"Chemical Instrumentation Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE303",
                "CHE302"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Electrochemical and thermochemical measurements. Electronics in chemical instrumentation. Vacuum techniques. Electrical and magnetic properties of materials. Data-handling methods. Six hours of laboratory and discussion. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE310":{
        "CourseTitle":"Chemistry in Technology and the Environment",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE132",
                "CHE152"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Use of chemical principles in understanding processes that occur in the modern technological world and in the natural environment. Certain ecological problems of a chemical nature are analyzed. Methods of controlling these problems are discussed. Not for credit in addition to ENV 320.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE312":{
        "CourseTitle":"Physical Chemistry for the Life Sciences",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE132"
            ],
            [
                "MAT132",
                "AMS161",
                "PHY121"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A one-semester treatment of fundamental concepts of physical chemistry, intended primarily for students of the biological sciences desiring an introduction to physical chemistry. Topics include equations of state; classical thermodynamics and its application to chemical equilibrium in reaction systems, multiphase systems, and electrochemical cells; kinetic theory of gases; transport properties; chemical kinetics. May not be taken for credit by students who have completed CHE 301. Not for credit toward the chemistry major.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE321":{
        "CourseTitle":"Organic Chemistry I",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE132"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"An introduction to the structure, reactivity, and properties of organic compounds is presented using modern views of chemical bonding. These fundamental ideas are applied to topics ranging from synthetic chemistry to complex functional structures such as lipid bilayers. CHE 321 may not be taken for credit in addition to\nCHE 331. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE322":{
        "CourseTitle":"Organic Chemistry IIA",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE321"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Discussion of the structure, reactivity, and properties of organic compounds introduced in CHE 321 is continued. The chemistry of substances important in biology, medicine, and technology is emphasized. CHE 322 may not be taken for credit in addition to CHE 332. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE327":{
        "CourseTitle":"Organic Chemistry Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE134",
                "CHE321"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Techniques of isolating and handling organic substances, including biological materials. A one-semester course that provides a basic organic laboratory experience. It is recommended that students take CHE 327 at the same time as CHE 321 or 322. Four laboratory hours and one lecture hour per week. Not for credit in addition to CHE 383. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE328":{
        "CourseTitle":"Synthetic and Spectroscopic Laboratory Techniques",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE327",
                "CHE322"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Application of fundamental laboratory techniques to organic and inorganic problems including multistep syntheses and structural and mechanistic determinations. Lectures cover material pertaining to the experimental work, with an emphasis on spectroscopy. Not for credit in addition to CHE 384. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE331":{
        "CourseTitle":"Molecular Science II",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE152",
                "CHE383"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Topics include the structural, mechanistic and synthetic aspects of organic chemistry, transition metal chemistry, catalysis, supramolecular chemistry, and polymer chemistry. This is the second course in a three semester sequence.  Students with a strong background prior to entering the University can take the 152-331-332 sequence, which covers the same material as 131-132-321-322. Three lecture hours and one 80-minute workshop per week. The laboratory component, CHE 383, must be taken the same semester as the CHE 331 lecture. May not be taken for credit in addition to CHE 321.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE332":{
        "CourseTitle":"Molecular Science III",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "CHE331"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Topics include advanced structural, mechanistic and synthetic aspects of organic chemistry, the organic chemistry of biological pathways and biosynthesis. This is the final course in a three semester sequence.  Students with a strong background prior to entering the University can take the 152-331-332 sequence, which covers the same material as 131-132-321-322. Three lecture hours and one 80-minute workshop per week. May not be taken for credit in addition to CHE 322.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE345":{
        "CourseTitle":"Structure and Reactivity in Organic Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE322",
                "CHE332",
                "CHE301",
                "CHE312"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Electronic and stereochemical theories relating to organic structure and reactions. Topics such as bonding, strain, aromaticity, MO theory, molecular rearrangements, pericyclic reactions, and photochemistry are covered.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE346":{
        "CourseTitle":"Biomolecular Structure and Reactivity",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE322",
                "CHE332"
            ],
            [
                "CHE301",
                "CHE312"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"The reactivity and physiological function of biological macromolecules and their monomeric constituents are described at the chemical level. The course reflects the most recent advances at the interface of organic chemistry and biochemistry. Specific topics include catalysis, biomimicry, protein and DNA modification, binding and target recognition, and correlation between three-dimensional structure and reactivity.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE348":{
        "CourseTitle":"Reaction Mechanisms in Organic Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE322",
                "CHE332"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Important classes of mechanisms of reactions useful in synthesis are explored. The kinetics and thermodynamics of these reactions are analyzed using modern structural theories. Examples of reaction types are substitutions, rearrangements, additions, eliminations, and selected organometallic reactions.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE351":{
        "CourseTitle":"Quantum Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE302"
            ],
            [
                "MAT203"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Concepts of quantum theory, Schrodinger wave mechanics, and related mathematical techniques illustrated by application to systems of chemical bonding, spectroscopy, molecular structure, and molecular collision phenomena.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE353":{
        "CourseTitle":"Chemical Thermodynamics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE302"
            ],
            [
                "CHE321"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A rigorous development of thermodynamics and its application to systems of interest to chemists, including electrochemical cells, gases, polymers, and homogeneous and heterogeneous equilibrium. An introduction to statistical mechanics is included.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE357":{
        "CourseTitle":"Molecular Structure and Spectroscopy Laboratory",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE304"
            ],
            [
                "CHE327",
                "CHE383"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Optical and magnetic resonance spectroscopy are used to investigate the structural, dynamic, and quantum mechanical properties of some basic chemical systems. Emphasis is on the quantitative measurement of molecular parameters and transformations. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE358":{
        "CourseTitle":"Computing in Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE302",
                "CHE304"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"The basic elements of scripting, design of computer programs, and numerical analysis are discussed within the framework of solving a variety of exciting problems chosen from all areas of chemistry. Topics include automation of repetitive tasks, fitting of data, numerical integration of rate equations, signal and image analysis, and quantum chemistry. No previous knowledge of computer programming is assumed.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE361":{
        "CourseTitle":"Nuclear Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "PHY126"
            ],
            [
                "AMS161",
                "MAT127"
            ],
            [
                "CHE362"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Properties of radioactive substances and their use in the study of chemical problems, nuclear stability and structure, nuclear reactions, radioactive decay, interactions of radiation with matter, nuclear medicine, isotope applications, and environmental control. Offered in summer only.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE362":{
        "CourseTitle":"Nuclear Chemistry Laboratory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE361"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Detection and measurement of radiation, electronic instrumentation, radiation safety, and application of radioactivity to chemical problems. Offered in summer only.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE375":{
        "CourseTitle":"Inorganic Chemistry I",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE322",
                "CHE332"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A survey of inorganic chemistry covering various classes of inorganic compounds and reactions with emphasis on the structural aspects. Wherever possible, the subject is treated on the basis of modern concepts of chemical bonding. Thermodynamic and kinetic aspects of inorganic reactions are included.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE376":{
        "CourseTitle":"Inorganic Chemistry II",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE375"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"The chemistry of the elements with an emphasis on the transition metals. Reaction mechanisms, synthesis, and structure are covered. Specific areas of concern include coordination chemistry, organometallic chemistry, bioinorganic chemistry, and selected topics from solid-state and non-transition metal chemistry.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE378":{
        "CourseTitle":"Materials Chemistry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE375",
                "ESG332"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Our high-technology world is driven forward by advances in materials chemistry. This class will discuss some of the materials that underpin these technologies, as well as some of the novel classes of materials that are being developed for future applications. The course will cover the synthesis, structures, and properties of advanced materials, focusing on a range of topics with current societal importance (e.g. energy, computers, nanoscience, etc.). Specific topics may include batteries, fuel cells, catalysts, metals, semiconductors, superconductors, magnetism, and polymers.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE379":{
        "CourseTitle":"Electrochemistry and Electrochemical Materials Science",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE375",
                "CHE301",
                "CHE302"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This course will survey electrochemistry and electrochemical materials science. Topics will include fundamental measurements in electrochemistry, galvanostatic and potentiostatic methods, the electrochemical double layer, corrosion and passivation. Relevant applications such as fuel cells, batteries, and supercapacitors will be discussed.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE383":{
        "CourseTitle":"Introductory Synthetic and Spectroscopic Laboratory Techniques",
        "Career":"Undergraduate",
        "Credits":2.0,
        "Prerequisites":[
            [
                "CHE154",
                "CHE331"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Fundamental laboratory techniques including methods of separation, purification, synthesis, and analysis. Emphasis is on organic with an introduction to inorganic problems. For students in the Molecular Sciences sequence. Not for credit in addition to CHE 327. Three lecture hours and one 80-minute workshop per week. The lecture component, CHE 331, must be taken the same semester as the CHE 383 laboratory. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE384":{
        "CourseTitle":"Intermediate Synthetic and Spectroscopic Laboratory Techniques",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE383",
                "CHE332"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Application of fundamental laboratory techniques to organic and inorganic problems including multistep syntheses and structural and mechanistic determinations. Lectures cover material pertaining to the experimental work, with an emphasis on spectroscopy. Not for credit in addition to CHE 328. This course has an associated fee. Please see www.stonybrook.edu\/coursefees for more information.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE385":{
        "CourseTitle":"Tools of Chemistry",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "CHE327",
                "CHE383"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A seminar course covering topics common to all areas of chemistry: scientific ethics; diversity, equity, and inclusion in the chemical sciences; chemical literature and information retrieval; scientific writing; and oral presentation.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE444":{
        "CourseTitle":"Experiential Learning",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "WRT102"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This course is designed for students who engage in a substantial, structured experiential learning activity in conjunction with another class. Experiential learning occurs when knowledge acquired through formal learning and past experience are applied to a \"real-world\" setting or problem to create new knowledge through a process of reflection, critical analysis, feedback and synthesis. Beyond-the-classroom experiences that support experiential learning may include: service learning, mentored research, field work, or an internship.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE459":{
        "CourseTitle":"Write Effectively in Chemistry",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "WRT102"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"A zero credit course that may be taken in conjunction with any 300- or 400-level CHE  course, with permission of the instructor. The course provides opportunity to practice the skills and techniques of effective academic writing and satisfies the learning outcomes of the Stony Brook Curriculum's WRTD learning objective.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE461":{
        "CourseTitle":"Selected Topics in Chemistry",
        "Career":"Undergraduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Semester supplements to this Bulletin contain specific description when course is offered. May be repeated as the topic changes.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE475":{
        "CourseTitle":"Undergraduate Teaching Practicum I",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Work with a faculty member as an assistant in one of the faculty member's regularly scheduled classes.  The student is required to attend all the classes, do all the regularly assigned work, and meet with the faculty member at regularly scheduled times to discuss the intellectual and pedagogical matters relating to the course.  Students may participate only in courses in which they have excelled.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE476":{
        "CourseTitle":"Undergraduate Teaching Practicum II",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Work with a faculty member as an assistant in one of the faculty member's regularly scheduled classes.  Students assume greater responsibility in such areas as leading discussions and analyzing results of tests that have already been graded. Students may participate only in courses in which they have excelled.  The course in which the student is permitted to work as a teaching assistant must be different from the course in which he or she previously served.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE477":{
        "CourseTitle":"Undergraduate Teaching Practicum III",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "CHE476"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Work with a faculty member as an assistant in one of the faculty member's regularly scheduled classes. Students may participate only in courses in which they have excelled. May be repeated.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE487":{
        "CourseTitle":"Research in Chemistry",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Students pursue research or tutorial study in specialized areas of chemistry. May be repeated.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE488":{
        "CourseTitle":"Internship",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":[
            [
                "CHE328"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"Research participation in off-campus laboratories. Students are required to submit to the department a proposal at the time of registration and a research report at the end of the semester. May be repeated up to a limit of 12 credits.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE495":{
        "CourseTitle":"Senior Research",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"First course of a two-semester research program to be carried out under the supervision of a staff member. The results of this work are to be submitted to the department in the form of a senior research report. The student is given an oral examination in May by a faculty committee consisting of the student's supervisor and three other faculty members. Students receive only one grade upon completion of the sequence CHE 495-496.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE496":{
        "CourseTitle":"Senior Research",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Second course of a two-semester research program to be carried out under the supervision of a staff member. The results of this work are to be submitted to the department in the form of a senior research report. The student is given an oral examination in May by a faculty committee consisting of the student's supervisor and three other faculty members. Students receive only one grade upon completion of the sequence CHE 495-496.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE501":{
        "CourseTitle":"Instrumental Methods in Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Practical and theoretical aspects of instrumentation in chemistry. The primary emphasis is on contemporary methods of molecular structure determination such as X-ray crystallography, NMR, IR, and MS. Other topics may also be presented.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE502":{
        "CourseTitle":"Mechanisms and Strategies in Organic Synthesis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course will focus on (1) the meaning and practice of writing organic reaction mechanisms and (2) standard synthetic reactions, their mechanisms, and modern refinements. Examples and applications will be presented. The course will also discuss biomimetic syntheses and the use of mechanism in designing total syntheses.\nFall, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE503":{
        "CourseTitle":"Synthetic Organic Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A survey of the most important organic reactions from the viewpoint of synthetic utility, including many recent innovations in this field. Throughout the discussion of these methods, emphasis is placed upon their use in the synthesis of complex organic structures.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE504":{
        "CourseTitle":"Structure and Reactivity in Organic Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Electronic and stereochemical theories relating to organic structure and reactions. Topics such as bonding, strain, aromaticity, MO theory, molecular rearrangements, pericyclic reactions, and photochemistry are covered. This course is intended to provide a foundation of knowledge at the beginning graduate level as preparation for advanced subjects in CHE 502 and CHE 503, and is complementary to CHE 501.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE511":{
        "CourseTitle":"Structural Inorganic Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Properties and reactions of inorganic compounds are considered from the viewpoint of molecular and electronic structure. The modern bonding theories used in inorganic chemistry including molecular orbital, valence bond, and ligand field theories are developed using symmetry and group theory. Selected main group, transition metal, and organometallic compounds are discussed. An introduction to crystallography and solid-state structure is included.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE514":{
        "CourseTitle":"Transition Metal Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A survey course with an emphasis on the transition metals. Reaction mechanisms, synthesis, and structure are covered. Specific areas of concern include coordination chemistry, organometallic chemistry, bioinorganic chemistry, and selected topics from solid-state and non-transition metal chemistry.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE515":{
        "CourseTitle":"Advanced Inorganic Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A topical course with an emphasis on the current literature. Subject matter varies and is announced in advance. Possible subjects include reaction mechanisms, organometallic chemistry, bioinorganic chemistry, and physical inorganic chemistry. May be repeated as the subject matter varies.\nSpring, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE516":{
        "CourseTitle":"Solid-State Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course will provide an introduction to structure and bonding in solid materials. This class will survey the important structural classes of periodic solids and will discuss space groups and the crystallographic symmetry elements important to these materials. Topics that will be covered may include, but are not limited to: (i) The mechanisms by which crystals grow and common types of defects. (ii) An introduction to the basics of band theory. (iii) An overview of the important synthetic methods for preparing solid state materials in nanocrystalline, powder, thin film, and single crystal form. (iv) A survey of the important techniques for assessing the composition, homogeneity, and crystallinity of materials (such as SEM, TEM, AFM, STM), with an emphasis on powder x-ray diffraction.\nFall, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE517":{
        "CourseTitle":"Structural Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Much of chemistry is concerned with the properties of atoms and molecules that are too small to see directly. This course will cover a variety of advanced techniques for elucidating the atomic-scale structure of molecules and periodic solids. A central technique is diffraction, which probes periodic arrays. The mathematical basis for diffraction will be presented, followed by practical examples of obtaining atomic coordinates from diffraction data (powder and\/or single crystal). Other techniques that may be covered include the analysis of local structure in partially ordered or disordered solids (via techniques such as PDF, EXAFS, small angle scattering, or solid state NMR), and the basis of more complex diffraction experiments (neutron\/electron diffraction, energy-dispersive\/Laue diffraction, and diffraction under extreme pressure\/temperature conditions).\nSpring, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE518":{
        "CourseTitle":"Materials Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Our high technology world is driven forward by advances in materials chemistry.  This class will discuss the origin of this technology, covering the synthesis, structures, and properties of advanced materials. These materials will be studied from a multidisciplinary perspective, since the knowledge required for their development spans more than one traditional academic discipline. This class will focus on broad topics with great current societal importance (energy, computing, nanoscience, etc.), and will discuss the materials at the heart of our present technology as well as novel classes of materials being developed for future technology applications. Specific topics may include batteries, fuel cells, catalysts, metallic conductors, semiconductors, superconductors, permanent magnets, magnetic films.\nSpring, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE519":{
        "CourseTitle":"Electrochemistry and Electrochemical Materials Science",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course will survey electrochemistry and electrochemical materials science. Topics will include fundamental measurements in electrochemistry, galvanostatic and potentiostatic methods, the electrochemical double layer, corrosion and passivation. Relevant applications such as fuel cells, batteries, and supercapacitors will be discussed.\nSpring, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE521":{
        "CourseTitle":"Quantum Chemistry I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Quantum theoretical concepts are discussed. Schrodinger wave mechanics and related mathematical techniques are illustrated by treatment of systems of chemical interest. Designed to form the theoretical basis for the study of chemical bonding, molecular structure, spectroscopy, and molecular collision phenomena.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE522":{
        "CourseTitle":"Molecular Spectroscopy",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A detailed description of the theory and practice of molecular spectroscopy. Topics include the interaction of molecules with electromagnetic radiation and the time evolution of molecular energy states.\nPrerequisite: CHE 521\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE523":{
        "CourseTitle":"Chemical Thermodynamics",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A rigorous development of the fundamentals of thermodynamics and its application to a number of systems of interest to chemists, such as electrochemical cells, gases, and homogeneous and heterogeneous equilibrium. An introduction to statistical mechanics will also be included.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE524":{
        "CourseTitle":"Magnetic Resonance",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course provides an introduction to the fundamental quantum mechanics of the magnetism of spin-1\/2 (and higher) particles. It includes a study of the Bloch equations (the responses of the magnetism to continuous-wave and pulsed irradiation) and a discussion of the experimental hardware and techniques commonly employed. Topics covered include the basics of the spin Hamiltonian (chemical shifts, J, dipolar, and quadrupolar couplings), dynamics and relaxation 1-D spectroscopy (spin and chemical exchange, lineshapes, spin echos, etc.), 2-D spectroscopy (homonuclear and heteronuclear correlation), techniques for studies of solids and liquid crystals (magic angle spinning, cross polarization, quadrupolar echo), and the principles of magnetic resonance imaging. Applications to the biological and material sciences, as well as chemical problems, will be discussed.\nSpring, alternate years,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE525":{
        "CourseTitle":"Theoretical Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course stresses the physical theory underlying chemical phenomena. Special emphasis is given to advanced topics in electronic structure theory, molecular dynamics, condensed matter and surfaces, many-body and quantum ensemble theory, and the interaction of light and molecules.\nPrerequisite: CHE 521",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE528":{
        "CourseTitle":"Statistical Mechanics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Statistical theory of equilibrium systems and rate processes. Ensemble theory, spatial and time correlation functions. Model systems and methods of estimating their properties. Designed to enable the student to use the current literature dealing with application of statistical mechanics to problems in chemistry.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE529":{
        "CourseTitle":"Quantitative Analysis of Materials",
        "Career":"Graduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course provides a brief overview of several quantitative approaches to characterizing materials, including small-angle X-ray and neutron scattering (SAXS\/SANS), fitting scattering data, colloidal phase behavior, dynamic light scattering (DLS), light scattering microrheology, crystallography and diffraction, grazing-incidence small-angle scattering (GISAXS), X-ray correlation photon spectroscopy (XPCS), and X-ray imaging and microscopy.\n\nSpring, 0-3 credits, Letter graded (A, A-, B+, etc.)",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE530":{
        "CourseTitle":"Physical Chemistry of Macromolecules",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"An investigation of the gross and fine structures of macromolecules and molecular aggregates in solution as revealed by hydrodynamic behavior (e.g., ultracentrifugation, viscosity), light scattering, spectroscopic properties (e.g., ultraviolet hypochromism, circular dichromism, Raman, fluorescence, magnetic resonance spectra), and the thermodynamics and kinetics of interaction with small molecules and ions. Theory of conformation changes and phase transitions.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE534":{
        "CourseTitle":"Computing in Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The basic elements of scripting, design of computer programs, and numerical analysis are discussed within the framework of solving a variety of exciting problems chosen from all areas of chemistry.  Topics include automation of repetitive tasks, fitting of data, numerical integration of rate equations, signal and image analysis, and quantum chemistry.  No previous knowledge of computer programming is assumed.\nFall, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE535":{
        "CourseTitle":"Introduction to Computational Structural Biology and Drug Design",
        "Career":"Graduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course will provide an introduction to Computational Structural Biology with application to Drug Design.  Methods and applications that use computation to model biological systems involved in human disease will be emphasized.  The course aims to foster collaborative learning and will consist of presentations by the instructor, guest lecturers, and by course participants with the goal of summarizing key methods, topics, and papers relevant to Computational Structural Biology.\nFall, 0-3 credits, ABCF grading\nCrosslisted with AMS 535",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE536":{
        "CourseTitle":"Molecular Modeling of Biological Bolecules",
        "Career":"Graduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":[
            [
                "CHE535"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"This course is designed for students who wish to gain hands-on experience modeling biological molecules at the atomic level. In conjunction with the individual interests, Molecular Mechanics, Molecular Dynamics, Monte Carlo, Docking (virtual screening), or Quantum Mechanics software packages can be used to study relevant biological system(s).  Projects will include setup, execution, and analysis.  Course participants will give literature presentations relevant to the simulations being performed and a final project report will be required.  Familiarity with UNIX (Linux) is desirable.\nPrerequisite:  CHE 535 or permission of instructor\nSpring, 0-3 credits, ABCF grading\nCrosslisted with AMS 536",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE541":{
        "CourseTitle":"Biomolecular Structure and Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The structures of biological macromolecules and the relationship of their structure to biological function are described.  Methodology employed to study macromolecules is also discussed.  Topics include chemical and physical properties of cell and tissue constituents, including carbohydrates, lipids, nucleic acids, proteins and peptides.  May not be taken by students with credit for MCB 520.\nPrerequisite: Strong foundation in physical and organic chemistry.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE542":{
        "CourseTitle":"Chemical Biology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The reactivity and physiological function of biological macromolecules and their cofactors are described at the chemical biochemical level.  The emphasis of this course reflects recent advances in chemical biology.  Possible topics include catalysts, reaction mechanisms, correlation between three-dimensional structure and reactivity, receptor-ligand interactions in extracellular and intracellular signaling, protein folding in vitro and in vivo.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE543":{
        "CourseTitle":"Chemical Approaches to Biology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CHE541",
                "MCB520"
            ]
        ],
        "Antirequisites":"NONE",
        "Description":"The use of molecular concepts and methodology to solve problems in biology and medicine. The course covers methods to elucidate and control biological systems. Possible topics include chemical genomics, metabolomics, and chemotherapeutics.\nPrerequisite CHE 542\nFall, 3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE558":{
        "CourseTitle":"Physical Biology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This is a course on the principles of physical chemistry.  We describe the nature of the forces and energies and entropies that drive molecular systems toward their states of equilibrium.  We consider a broad range of applications throughout chemistry, biology, materials engineering and  nanoscience.  This course aims to give students an understanding of how the actions and behaviors of materials arise from their atomic and molecular structures.\nCo-listed with PHY 558\nSpring, 3 credits, ABCF Grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE559":{
        "CourseTitle":"Biological Dynamics and Networks",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course will provide a solid foundation in key theoretical concepts for the study of dynamics in biological systems and networks at different scales ranging from the molecular level to metabolic and gene regulatory networks. Topics of this course include but are not limited to: Physical kinetics; Diffusion\/Smoluchowskii; Random flights; Waiting times; Poisson; Brownian ratchets; Chemical kinetics; Transition states; Stability, bifurcations, pattern development; Noise in cells: intrinsic and Extrinsic; Feedback; Biological Osciillators; Recurrence, period doubling, chaos; Networks; Topologies; Degree distribution, betweenness; Models of nets: Erdos-Renyi, scale-free, social, Watts-Strogatz, agents; Robustness, highly-optimized tolerance, bowties, epidemics; Biological networks: Protein-protein nets, regulatory and metabolic nets; Known biological circuits and their behaviors; How networks evolve: Preferential attachment, rewiring; Power laws; Fluxed through networks; Information and communication, entropy; Metabolic flux analysis; Artificial and Natural selection for traits; Darwinian evolution; Population dynamics.\nSpring, 3 credits, ABCF grading\nCrosslisted with PHY 559 and CHE 559",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE581":{
        "CourseTitle":"Departmental Research Seminar",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Meetings in which first-year graduate students learn about the research activities of the departmental faculty.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE582":{
        "CourseTitle":"Literature Seminar",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Students select and discuss topics from the current literature.\nSpring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE586":{
        "CourseTitle":"Professional Skills for Scientists",
        "Career":"Graduate",
        "Credits":2.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Development and refinement of the professional skills used by scientists: An exploration of more sophisticated presentation skills used in oral and poster presentations; incorporatyion of collaborative problem solving that mimics real world situations, including simple proposal writing; exposure to professional societies and meetings; an exploration of career options and employment resources; tips for resume preparation and interviews. Recommended for upper divsion endergraduates and masters students.\nWinter, 2 credits, ABCF Grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE588":{
        "CourseTitle":"Graduate Workshop",
        "Career":"Graduate",
        "Credits":"0.00 - 1.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Additional problem solving and team learning on topics from a concurrent formal graduate course. Topics vary. Fall and Spring, 0-1 credits, S\/U grading. May be repeated for credits.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE589":{
        "CourseTitle":"Directed Study",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Subject matter varies according to needs of student.\nFall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE590":{
        "CourseTitle":"M.S. Term Paper",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Seminar leading to a term paper on a selected topic in chemistry, chemical applications, or chemical pedagogy. \nFall, Spring, Summer",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE591":{
        "CourseTitle":"Chemistry of the Environment",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course provides an overview of the chemistry of environmental processes, environmental degradation, remediation and abatement processes, and energy production. Past actions and current efforts of the chemical enterprise in both exacerbating and addressing anthropogenic environmental degradation are discussed.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE593":{
        "CourseTitle":"Chemical Demonstrations",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The design and implementation of demonstrations to illustrate modern concepts of chemistry.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE596":{
        "CourseTitle":"Teaching and Learning Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The objective of CHE 596 is to better prepare students for the kinds of interactions they are likely to have in their careers when communicating their chemistry. Specifically, this course will help students to: (i) develop competency with research-based approaches to facilitating discourse that is generative for improving scientific understandings of chemistry phenomena; (ii) recognize the importance of representations in chemistry and to incorporate a more explicit modeling perspective and approach for developing scientific literacy; (iii) develop teaching strategies to effectively communicate abstract and complex chemical concepts to advise expert and non-expert audiences; (iv) develop curricular interventions aimed at improving individual and community practice of challenging conceptual ideas; (v) incorporate historical and philosophical perspectives on the development of fundamental chemical principles into the teaching of those topics in diverse settings; (vi) become aware of recent developments in the learning progressions literature to inform understanding of appropriate curriculum planning and implementation; and (vii) develop an identity towards reflective practice and empowerment of fellow chemistry educators into positions of leadership.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE597":{
        "CourseTitle":"M.S. Research Thesis Development",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"This course provides a structured environment for students to develop their research project into a written thesis.  Students will receive instruction and guidance in performing literature research related to their project and in developing this background material along with their own research into a properly written document.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE598":{
        "CourseTitle":"Professional Masters Internship",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Participation in private corporations, public agencies, or non-profit institutions for research and other experiential training activities related to the completion of a Master term paper.  Students will be required to have a faculty coordinator as well as a contact in the outside organization, to participate with them in regular consultations on the project, and to successfully complete CHE 590.\nPrerequisites: Permission of Master's Program Director.\n0-12 credits, S\/U grading\nMay be repeated for credit\nOffered Fall, Spring, and Summer, Every Semester",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE599":{
        "CourseTitle":"Research",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall, Spring, Summer",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE602":{
        "CourseTitle":"Special Topics in Physical Organic Chemistry",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The subject matter varies depending on interests of students and staff. It may cover such areas as photochemistry, theoretical organic chemistry, and the chemistry of unstable intermediates; the emphasis is on fundamental considerations and recent developments.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE603":{
        "CourseTitle":"Special Topics in Bioorganic Chemistry",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"The subject matter varies depending on interests of students and faculty. Possible topics include asymmetric synthesis and natural product synthesis.\nFall,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE606":{
        "CourseTitle":"Special Topics in Synthetic Chemistry",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE607":{
        "CourseTitle":"Modern Drug Design & Discovery",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A seminar course covering modern aspects and approaches to drug design.  This course combines presentations by faculty and by industry representatives to provide a cross-disciplinary view of the development of pharmaceuticals.\nFall, variable 1-3 credits, ABCF grading",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE610":{
        "CourseTitle":"Practicum in Teaching",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Practice instruction in chemistry at the undergraduate level, carried out under faculty orientation and supervision. A minimum of two semesters of CHE 610 or 611 is required of all candidates for graduate research degrees in chemistry, unless explicitly waived by the chairperson.\nFall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE611":{
        "CourseTitle":"Practicum in Teaching",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Practice instruction in chemistry at the undergraduate level, carried out under faculty orientation and supervision. A minimum of two semesters of CHE 610 or 611 is required of all candidates for graduate research degrees in chemistry, unless explicitly waived by the chairperson.\nFall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE619":{
        "CourseTitle":"Critical Readings of Current Topics in Chemistry",
        "Career":"Graduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Recent research papers from the literature will be analyzed in depth. These papers may originate from the inorganic, organic, physical, and\/or biochemical literature. The exact topic of the course is announced in advance. Fall and Spring",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE625":{
        "CourseTitle":"Molecular Structure and Crystallography",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Experimental methods in the determination of molecular structure. The emphasis is on the determination of structure in the solid state, particularly by X-ray crystallography. Students complete a single-crystal molecular structure determination using modern diffractometer techniques.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE641":{
        "CourseTitle":"Organometallic Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"A systematic presentation of the chemistry of organometallic compounds, particularly those of the transition metals. Topics include structure, bonding, reaction mechanisms, synthesis, and applications in catalysis and organic synthesis.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE682":{
        "CourseTitle":"Special Topics in Inorganic Chemistry",
        "Career":"Graduate",
        "Credits":"0.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Subject matter varies, depending on interests of students and staff, but covers recent developments in inorganic chemistry.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE683":{
        "CourseTitle":"Special Topics in Physical Chemistry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Subject matter varies, depending on interests of students and staff, but covers recent developments and advanced topics in physical chemistry.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE690":{
        "CourseTitle":"Internship in Dissertation-Related Research",
        "Career":"Graduate",
        "Credits":"1.00 - 3.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Supervised curricular training in dissertation-related research. \nPrerequisite: For full-time: Summer session or advancement to candidacy; Permission of Graduate Program Director.\nFall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE693":{
        "CourseTitle":"Physical Chemistry Seminar",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE694":{
        "CourseTitle":"Biological Chemistry Seminar",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE695":{
        "CourseTitle":"Inorganic Chemistry Seminar",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE696":{
        "CourseTitle":"Organic Chemistry Seminar",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE697":{
        "CourseTitle":"Seminar in Physical and Quantitative Biology",
        "Career":"Graduate",
        "Credits":"0.00 - 1.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and spring, 0-1 credits, S\/U grading.\nMay be repeated for credit.",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE698":{
        "CourseTitle":"Colloquium",
        "Career":"Graduate",
        "Credits":"0.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Fall and Spring,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE699":{
        "CourseTitle":"Dissertation Research on Campus",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Prerequisite: Must be advanced to candidacy (G5). Major portion of research must take place on SBU campus, at Cold Spring Harbor, or at the Brookhaven National Lab.\nFall, Spring, and Summer,",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE700":{
        "CourseTitle":"Dissertation Research off Campus - Domestic",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Prerequisite: Must be advanced to candidacy (G5). Major portion of research will take place off-campus, but in the United States and\/or U.S. provinces. Please note, Brookhaven National Labs and the Cold Spring Harbor Lab are considered on-campus.\nAll international students must enroll in one of the graduate student insurance plans and should be advised by an International Advisor.\nFall, Spring, Summer",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE701":{
        "CourseTitle":"Dissertation Research off Campus - International",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"Prerequisite: Must be advanced to candidacy (G5). Major portion of research will take place outside of the United States and\/or U.S. provinces.\nDomestic students have the option of the health plan and may also enroll in MEDEX.\nInternational students who are in their home country are not covered by mandatory health plan and must contact the Insurance Office for the insurance charge to be removed.\nInternational students who are not in their home country are charged for the mandatory health insurance. If they are to be covered by another insurance plan they must file a waiver be second week of classes. The charge will only be removed if other plan is deemed comparable.\nAll international students must received clearance from an International Advisor.\nFall, Spring, Summer",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    },
    "CHE800":{
        "CourseTitle":"SUMMER RESEARCH",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Description":"",
        "spring1":1,
        "fall1":1,
        "spring2":1,
        "fall2":1
    }
}