{
    "MAT118":{
        "CourseTitle":"Mathematical Thinking",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAP103"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Development of quantitative thinking and problem solving abilities through a selection of mathematical topics: logic and reasoning; numbers, functions, and modeling; combinatorics and probability; growth and change. Other topics may include geometry, statistics, game theory, and graph theory. Through their engagement in problem solving, students develop an appreciation of the intellectual scope of mathematics and its connections with other disciplines.",
        "spring":1,
        "fall":1
    },
    "MAT119":{
        "CourseTitle":"Foundations for Precalculus",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "MAT123"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "MAT123"
            ]
        ],
        "Description":"This course is a companion to MAT 123: Precalculus, providing a structured environment where students can refresh the algebra skills which are necessary for success in precalculus. These topics include understanding of exponents (especially fractional and negative exponents), manipulating mathemematical expressions, solving equations, and modeling\/word problems. Course may not be taken with CHE 129.",
        "spring":1,
        "fall":1
    },
    "MAT122":{
        "CourseTitle":"Overview of Calculus with Applications",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAP103"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The basics of calculus in a self-contained, one-semester course. Properties and applications of polynomial, exponential, and logarithmic functions. Derivatives:  slopes, rates of change, optimization, integrals, area, cumulative change, and average. The fundamental theorem of calculus. Emphasis on modeling examples from economics. Students who subsequently wish to enroll in MAT 125 or 131 will be required to score level 4 on the mathematics placement examination before taking either course. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT123":{
        "CourseTitle":"Precalculus",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAP103"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Comprehensive preparation for the regular calculus sequences. Careful development of rational, exponential, logarithmic, and trigonometric functions, and their applications. Asymptotics and curve sketching. General modeling examples. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT125":{
        "CourseTitle":"Calculus A",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT123"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Differential calculus, emphasizing conceptual understanding, computations and applications, for students who have the necessary background from 12th-year high school mathematics. Limits and continuous functions. Differentiation of elementary algebraic, trigonometric, exponential and logarithmic functions; graphing; modeling; and maximization. L'Hospital's rule.  May not be taken for credit in addition to MAT 131 or 141 or AMS 151. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT126":{
        "CourseTitle":"Calculus B",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT125",
                "AMS151"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A continuation of MAT 125, covering integral calculus: Riemann sums, the fundamental theorem, symbolic and numeric methods of integration, area under a curve, volume, applications such as work and probability, improper integrals. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT127":{
        "CourseTitle":"Calculus C",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT126"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A continuation of MAT 126, covering: sequences, series, Taylor series, differential equations and modeling.  May not be taken for credit in addition to MAT 132, MAT 142, MAT 171, or AMS 161. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT130":{
        "CourseTitle":"Trigonometry and Logarithms",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":[
            [
                "MAT122",
                "MAT125"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Inverse functions, exponential and logarithmic functions, radian measure of angles and trigonometric functions. Taught as a companion to MAT 125.",
        "spring":1,
        "fall":1
    },
    "MAT131":{
        "CourseTitle":"Calculus I",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT123"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The differential calculus and integral calculus, emphasizing conceptual understanding, computations and applications, for students who have the necessary background from 12th-year high school mathematics.  Differentiation of elementary algebraic; trigonometric, exponential, and logarithmic functions; graphing; modelling and maximization; L'Hospital's rule; the Riemann integral; and the Fundamental Theorem of Calculus. May not be taken for credit in addition to MAT 125 or 141 or AMS 151. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT132":{
        "CourseTitle":"Calculus II",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "AMS151",
                "MAT131"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A continuation of MAT 131, covering symbolic and numeric methods of integration; area under a curve; volume; applications such as work and probability; sequences; series; Taylor series; differential equations; and modelling. May not be taken for credit in addition to MAT 127, MAT 142, MAT 171, or AMS 161. This course has been designated as a High Demand\/Controlled Access (HD\/CA) course. Students registering for HD\/CA courses for the first time will have priority to do so.",
        "spring":1,
        "fall":1
    },
    "MAT200":{
        "CourseTitle":"Logic, Language and Proof",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A basic course in the logic of mathematics, the construction of proofs and the writing of proofs. The mathematical content is primarily logic and proofs, set theory,  combinatorics, functions and relations. There is considerable focus on writing. May not be taken for credit in addition to MAT 250.",
        "spring":1,
        "fall":1
    },
    "MAT203":{
        "CourseTitle":"Calculus III with Applications",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT127",
                "AMS161"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Vector algebra in two and three dimensions, multivariate differential and integral calculus, optimization, vector calculus including the theorems of Green, Gauss, and Stokes. Applications to economics, engineering, and all sciences, with emphasis on numerical and graphical solutions; use of graphing calculators or computers. May not be taken for credit in addition to AMS 261.",
        "spring":1,
        "fall":1
    },
    "MAT211":{
        "CourseTitle":"Introduction to Linear Algebra",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "AMS151",
                "MAT131",
                "MAT126"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to the theory of linear algebra with some applications; vectors, vector spaces, bases and dimension, applications to geometry, linear transformations and rank, eigenvalues and eigenvectors, determinants and inner products. May not be taken for credit in addition to AMS 210.",
        "spring":1,
        "fall":1
    },
    "MAT250":{
        "CourseTitle":"Introduction to Advanced Mathematics",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT131"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the Advanced Track mathematics program. Provides the core of basic of propositional logic, quantifiers, proofs, sets, functions, cardinality, relations, equivalence relations and quotient sets, order relations, combinatorics. Number systems: natural numbers, integers, rational, real and complex numbers. MAT 250 is primarily intended for students in the Advanced Track program. It serves as an alternative to MAT 200 and may not be taken for credit in addition to MAT 200. Students wishing to enroll in MAT 250 should instead enroll in a corresponding section of MAT 200. In approximately the 3rd week, an assessment will be held and qualified students will be offered the option of moving to MAT 250. Formerly offered as MAT 150; not for credit in addition to MAT 150.",
        "spring":1,
        "fall":1
    },
    "MAT260":{
        "CourseTitle":"Problem Solving in Mathematics",
        "Career":"Undergraduate",
        "Credits":1.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Students actively solve challenging problems in  plane geometry, basic number theory, and calculus, and write precise arguments. Relevant preparation for problem-solving is provided in the course.",
        "spring":1,
        "fall":1
    },
    "MAT303":{
        "CourseTitle":"Calculus IV with Applications",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT127",
                "AMS161"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Homogeneous and inhomogeneous linear differential equations; systems of linear differential equations; series solutions; Laplace transforms; Fourier series. Applications to economics, engineering, and all sciences with emphasis on numerical and graphical solutions; use of computers. May not be taken for credit in addition to AMS 361 or MAT 308.",
        "spring":1,
        "fall":1
    },
    "MAT307":{
        "CourseTitle":"Multivariable Calculus with Linear Algebra",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT127",
                "MAT132"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to linear algebra: vectors, matrices, systems of linear equations,  bases and dimension, dot product, determinants. Multivariate differential and integral calculus, divergence and curl, line and surface integrals, theorems of Green, Gauss, and Stokes. More theoretical and intensive than MAT 203, this course is primarily intended for math majors. Together with MAT 308, it forms a 2-semester sequence covering the same material as the 3-semester sequence of MAT 203, MAT 211 and MAT 303. May not be taken for credit in addition to MAT 203 or AMS 261.",
        "spring":1,
        "fall":1
    },
    "MAT308":{
        "CourseTitle":"Differential Equations with Linear Algebra",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT307"
            ],
            [
                "MAT203"
            ],
            [
                "MAT211"
            ],
            [
                "MAT132"
            ],
            [
                "MAT220"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Linear algebra: determinants, eigenvalues and  eigenvectors, diagonalization. Differential equations; existence and uniqueness of solutions. First- and second-order equations; linear versus nonlinear equations. Systems of linear equations. Laplace transform. Applications to physics. More theoretical and intensive than MAT 303, this course is primarily intended for math majors. Together with MAT 307, it forms a 2-semester sequence covering the same material as the 3-semester sequence of MAT 205, MAT 211 and MAT 305. May not be taken for credit in addition to MAT 303 or AMS 361.",
        "spring":1,
        "fall":1
    },
    "MAT310":{
        "CourseTitle":"Linear Algebra",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT211",
                "AMS210",
                "MAT220"
            ],
            [
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Finite dimensional vector spaces, linear maps, dual spaces, bilinear functions, inner products. Additional topics such as canonical forms, multilinear algebra, numerical linear algebra.",
        "spring":1,
        "fall":1
    },
    "MAT311":{
        "CourseTitle":"Number Theory",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT312"
            ],
            [
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Congruences, quadratic residues, quadratic forms, continued fractions, Diophantine equations, number-theoretical functions, and properties of prime numbers.",
        "spring":1,
        "fall":1
    },
    "MAT312":{
        "CourseTitle":"Applied Algebra",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "AMS210",
                "MAT211",
                "MAT220",
                "MAT200",
                "CSE215",
                "CSE150"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics in algebra: groups, informal set theory, relations, homomorphisms. Applications: error correcting codes, Burnside's theorem, computational complexity, Chinese remainder theorem. This course is offered as both AMS 351 and  MAT 312.",
        "spring":1,
        "fall":1
    },
    "MAT313":{
        "CourseTitle":"Abstract Algebra",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT310",
                "MAT312",
                "MAT315"
            ],
            [
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Groups and rings together with their homomorphisms and quotient structures. Unique factorization, polynomials, and fields.",
        "spring":1,
        "fall":1
    },
    "MAT314":{
        "CourseTitle":"Abstract Algebra II",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT313"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course is a continuation of MAT 313, Abstract algebra. It covers modules over rings, including structure theorem for modules over PID, theory of fields and field extensions and introduction to Galois theory.",
        "spring":1,
        "fall":1
    },
    "MAT315":{
        "CourseTitle":"Advanced Linear Algebra",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT200",
                "MAT250"
            ],
            [
                "MAT211",
                "AMS219",
                "MAT308",
                "MAT220"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Finite dimensional vector spaces over a field, linear maps, isomorphisms, dual\nspaces, quotient vector spaces, bilinear and quadratic functions, inner products,\ncanonical forms of linear operators, multilinear algebra, tensors. This course serves as an alternative to MAT 310. It is an intensive course, primarily intended for math majors in Advanced Track program. Students wishing to enroll in MAT 315 should instead enroll in MAT 310. In approximately the 4th week, an assessment will be held and qualified students will be offered the option of moving to MAT 315.",
        "spring":1,
        "fall":1
    },
    "MAT319":{
        "CourseTitle":"Foundations of Analysis",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT200",
                "MAT250"
            ],
            [
                "MAT203",
                "AMS261",
                "MAT127",
                "AMS161"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A careful study of the theory underlying topics in one-variable calculus, with an emphasis on those topics arising in high school calculus. The real number system. Limits of functions and sequences. Differentiations, integration, and the fundamental theorem. Infinite series.",
        "spring":1,
        "fall":1
    },
    "MAT320":{
        "CourseTitle":"Introduction to Analysis",
        "Career":"Undergraduate",
        "Credits":4.0,
        "Prerequisites":[
            [
                "MAT200",
                "MAT250"
            ],
            [
                "MAT203",
                "AMS261",
                "MAT127",
                "AMS161"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A careful study of the theory underlying calculus. The real number system. Basic properties of functions of one real variable. Differentiation, integration, and the inverse theorem. Infinite sequences of functions and uniform convergence. Infinite series. Metric spaces and compactness. This course is a more demanding alternative of MAT 319, suitable for students who are comfortable with rigorous proofs. Students wishing to enroll in MAT 320 should instead enroll in MAT 319. In approximately the 6th week, an assessment will be held and qualified students will be offered the option of moving to MAT 320.",
        "spring":1,
        "fall":1
    },
    "MAT322":{
        "CourseTitle":"Analysis in Several Dimensions",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "MAT220",
                "MAT307",
                "AMS261"
            ],
            [
                "MAT310",
                "MAT315"
            ],
            [
                "MAT320"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Continuity, differentiation, and integration in Euclidean n-space. Differentiable maps. Implicit and inverse function theorems. Differential forms and the general Stokes's theorem.",
        "spring":1,
        "fall":1
    },
    "MAT324":{
        "CourseTitle":"Real Analysis",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT320"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to Lebesgue measure and integration. Aspects of Fourier series, function spaces, Hilbert spaces, Banach spaces.",
        "spring":1,
        "fall":1
    },
    "MAT331":{
        "CourseTitle":"Computer-Assisted Mathematical Problem Solving",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "AMS261"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Exploration of the use of the computer as a tool to gain insight into complex mathematical problems through a project-oriented approach. Students learn both the relevant mathematical concepts and ways that the computer can be used (and sometimes misused) to understand them. The particular problems may vary by semester; past topics have included cryptography, fractals and recursion, modeling the flight of a glider, curve fitting, the Brachistochrone, and computer graphics. No previous experience with computers is required.",
        "spring":1,
        "fall":1
    },
    "MAT336":{
        "CourseTitle":"History of Mathematics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT200",
                "MAT203",
                "MAT250",
                "MAT307",
                "AMS261"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of the history of mathematics from the beginnings through the 19th century, with special attention to primary sources and to the interactions between culture and mathematics. Emphasis on topics germane to the high school curriculum. Mesopotamian, Egyptian, and Greek mathematics; non-European mathematics; early Renaissance mathematics;  the birth and flowering of calculus; the beginnings of probability theory; and the origin of non-Euclidean geometries and the modern concept of number.",
        "spring":1,
        "fall":1
    },
    "MAT341":{
        "CourseTitle":"Applied Real Analysis",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "AMS261"
            ],
            [
                "MAT303",
                "AMS361",
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Partial differential equations of mathematical physics: the heat, wave, and Laplace equations. Solutions by techniques such as separation of variables using orthogonal functions (e.g., Fourier series, Bessel functions, Legendre polynomials). D'Alembert solution of the wave equation.",
        "spring":1,
        "fall":1
    },
    "MAT342":{
        "CourseTitle":"Applied Complex Analysis",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "MAT220",
                "MAT307",
                "AMS261",
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Complex numbers, analytic functions, the Cauchy-Riemann and Laplace equations, the Cauchy integral formula and applications. Fundamental Theorem of Algebra and the Maximum Principle. The Cauchy residue theorem and applications to evaluating real integrals. Conformal mappings.",
        "spring":1,
        "fall":1
    },
    "MAT351":{
        "CourseTitle":"Differential Equations: Dynamics and Chaos",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "MAT220",
                "MAT307",
                "AMS261"
            ],
            [
                "MAT303",
                "MAT308",
                "AMS361"
            ],
            [
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A study of the long-term behavior of solutions to ordinary differential equations or of iterated mappings, emphasizing the distinction between stability on the one hand and sensitive dependence and chaotic behavior on the other. The course describes examples of chaotic behavior and of fractal attractors, and develops some mathematical tools for understanding them.",
        "spring":1,
        "fall":1
    },
    "MAT360":{
        "CourseTitle":"Geometric Structures",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Formal geometries and models. Topics selected from projective, affine, Euclidean, and non-Euclidean geometries.",
        "spring":1,
        "fall":1
    },
    "MAT362":{
        "CourseTitle":"Differential Geometry of Surfaces",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT319",
                "MAT320",
                "MAT364"
            ],
            [
                "MAT203",
                "MAT307",
                "MAT322"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The local and global geometry of surfaces: geodesics, parallel transport, curvature, isometries, the Gauss map, the Gauss-Bonnet theorem.",
        "spring":1,
        "fall":1
    },
    "MAT364":{
        "CourseTitle":"Topology and Geometry",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT203",
                "AMS261"
            ],
            [
                "MAT200",
                "MAT319"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A broadly based introduction to topology and geometry, the mathematical theories of shape, form, and rigid structure. Topics include intuitive knot theory, lattices and tilings, non-Euclidean geometry, smooth curves and surfaces in Euclidean 3-space, open sets and continuity, combinatorial and algebraic invariants of spaces, higher dimensional spaces.",
        "spring":1,
        "fall":1
    },
    "MAT371":{
        "CourseTitle":"Logic",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CSE150",
                "CSE215",
                "MAT200",
                "MAT250"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A survey of the logical foundations of mathematics: development of propositional calculus and quantification theory, the notions of a proof and of a model, the completeness theorem, Goedel's incompleteness theorem. This course is offered as both CSE 371 and MAT 371.",
        "spring":1,
        "fall":1
    },
    "MAT373":{
        "CourseTitle":"Analysis of Algorithms",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "CSE150",
                "CSE215",
                "MAT200",
                "MAT250"
            ],
            [
                "MAT211",
                "AMS210"
            ],
            [
                "CSE214",
                "CSE260"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Mathematical analysis of a variety of computer algorithms including searching, sorting, matrix multiplication, fast Fourier transform, and graph algorithms. Time and space complexity. Upper-bound, lower- bound, and average-case analysis. Introduction to NP completeness. Some machine computation is required for the implementation and comparison of algorithms. This course is offered as CSE 373 and MAT 373. Not for credit in addition to CSE 385.",
        "spring":1,
        "fall":1
    },
    "MAT401":{
        "CourseTitle":"Seminar in Mathematics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Discussions of a specific area of interest in mathematics. The work of each semester covers a different area of mathematics. May be repeated as topic changes. Prerequisites will be announced with the topic each time the course is offered.",
        "spring":1,
        "fall":1
    },
    "MAT402":{
        "CourseTitle":"Seminar in Mathematics",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Discussions of a specific area of interest in mathematics. The work of each semester covers a different area of mathematics. May be repeated as topic changes. Prerequisites will be announced with the topic each time the course is offered.",
        "spring":1,
        "fall":1
    },
    "MAT444":{
        "CourseTitle":"Experiential Learning",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "WRT102"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course is designed for students who engage in a substantial, structured experiential learning activity in conjunction with another class. Experiential learning occurs when knowledge acquired through formal learning and past experience are applied to a \"real-world\" setting or problem to create new knowledge through a process of reflection, critical analysis, feedback and synthesis. Beyond-the-classroom experiences that support experiential learning may include: service learning, mentored research, field work, or an internship.",
        "spring":1,
        "fall":1
    },
    "MAT458":{
        "CourseTitle":"Speak Effectively Before an Audience",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":[
            [
                "WRT102"
            ]
        ],
        "Description":"A zero credit course that may be taken in conjunction with any MAT course that provides opportunity to achieve the learning outcomes of the Stony Brook Curriculum's SPK learning objective.",
        "spring":1,
        "fall":1
    },
    "MAT459":{
        "CourseTitle":"Write Effectively in Mathematics",
        "Career":"Undergraduate",
        "Credits":0.0,
        "Prerequisites":[
            [
                "WRT102"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A zero credit course that may be taken in conjunction with any 300- or 400-level MAT course, with permission of the instructor. The course provides opportunity to practice the skills and techniques of effective academic writing and satisfies the learning outcomes of the Stony Brook Curriculum's WRTD learning objective.",
        "spring":1,
        "fall":1
    },
    "MAT475":{
        "CourseTitle":"Undergraduate Teaching Practicum",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Each student assists in teaching a lower-division mathematics course or works in the Mathematics Learning Center. The student's work is regularly supervised by a faculty member. In addition, a weekly seminar is conducted. Responsibilities may include preparation of materials for student use and discussions, helping students with problems, and involvement in \"alternative\" teaching projects. Intended for upper-division students who have excelled in the calculus sequence. May not be used for major credit.",
        "spring":1,
        "fall":1
    },
    "MAT487":{
        "CourseTitle":"Independent Study in Special Topics",
        "Career":"Undergraduate",
        "Credits":"0.00 - 6.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A reading course for juniors and seniors. The topics may be chosen by the student with the approval of a supervising member of the faculty, who also takes responsibility for evaluation. A topic that is covered in a course regularly offered by the department is not appropriate for independent study. May be repeated.",
        "spring":1,
        "fall":1
    },
    "MAT495":{
        "CourseTitle":"Honors Thesis",
        "Career":"Undergraduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"The student and a supervising faculty member together choose a topic in mathematics, and the student writes a substantial paper expounding the topic in a new way.",
        "spring":1,
        "fall":1
    },
    "MAT511":{
        "CourseTitle":"Fundamental Concepts of Mathematics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Fundamental Concepts of Mathematics. Brief history of mathematics; sets, functions and logic; constructions of number systems, including their historical development; mathematical induction. The main focus of the course will be on the construction and writing of mathematical proofs.\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT512":{
        "CourseTitle":"Algebra for Teachers",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Linear algebra, the algebra of polynomials, algebraic properties of the complex numbers, number fields, solutions of equations. Mathematical topics integrate the study of the historical development of algebra, including contributions from diverse cultures.\nPrerequisite: MAT 511\nSemesters Offered: Fall, Spring, Summer",
        "spring":1,
        "fall":1
    },
    "MAT513":{
        "CourseTitle":"Analysis for Teachers I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics in differential calculus, its foundations, and its applications. This course is designed for teachers and prospective teachers of advanced placement calculus. Mathematical topics integrate the study of the historical development of calculus, including contributions from diverse cultures.\nPrerequisite: MAT 511\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT514":{
        "CourseTitle":"Analysis for Teachers II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics in calculus, its foundations, and its applications. Emphasis is on integration and on numerical techniques. This course is designed for teachers and prospective teachers of advanced placement calculus. Mathematical topics integrate the study of the historical development of calculus, including contributions from diverse cultures. Analysis for Teachers I is not a prerequisite for this course.\nPrerequisite: MAT 511\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT515":{
        "CourseTitle":"Geometry for Teachers",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A re-examination of elementary geometry using concepts from analysis and algebra. Mathematical topics integrate the study of the historical development of Euclidean and non-Euclidian geometries, including contributions from diverse cultures.\nPrerequisite: MAT 511\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT516":{
        "CourseTitle":"Probability and Statistics for Teachers",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A priori and empirical probabilities; conditional probability; mean and standard deviation; random variables; financial distributions; continuous distributions; sampling; estimation; decision making. Mathematical topics integrate the study of the historical development of statistics and probability, including contributions from diverse cultures.\nPrerequisite: MAT 511\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT517":{
        "CourseTitle":"Calculators and Computers for Teachers",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Calculators and Computers for teachers. Graphing calculators, programming, computing and curve sketching; Geometers Sketchpad or other computer based classroom tools; educational use of the world wide web.\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT518":{
        "CourseTitle":"Seminar on the Uses of Mathematics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This seminar explores the ways in which secondary school and elementary college mathematics are used in such diverse areas as psychology, sociology, political science, economics, business, engineering, physics, chemistry, biology, and medicine. Primarily for secondary school teachers of mathematics.\nFall, Spring, or Summer,",
        "spring":1,
        "fall":1
    },
    "MAT519":{
        "CourseTitle":"Seminar in Mathematics in Teaching and Learning",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Seminar format. This course involves deliberative group inquiry - through reading, writing and intensive discussion - into mathematics teaching, learning and mathematics education research; analysis and design of cognitively demanding mathematical tasks; and analysis of students' mathematical thinking, written responses, and common misconceptions in the mathematics classroom. Each student completes an action research project focused on a topic selected with guidance from the instructor.\nOffered alternate years, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT520":{
        "CourseTitle":"Geometry for Teachers II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT511"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Vector algebra on the  plane and in the 3-space;  area and volume of geometric figures; analytic  geometry.\nPrerequisite: MAT  511\nSpring, 3 credits, Letter  grad ed (A,  A-,  B+,  etc.) Spring, 3 credits, Letter graded (A,  A-, B+,  etc.)",
        "spring":1,
        "fall":1
    },
    "MAT521":{
        "CourseTitle":"Introduction to Number Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Congruences, quadratic residues, quadratic forms, continued fractions, Diophantine equations, number-theoretical functions, and properties of prime numbers.",
        "spring":1,
        "fall":1
    },
    "MAT522":{
        "CourseTitle":"Introduction to Measure Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to Lebesgue measure and integration.  Aspects of Fourier series, function spaces, Hilbert spaces, Banach spaces.",
        "spring":1,
        "fall":1
    },
    "MAT523":{
        "CourseTitle":"Analysis in Several Dimensions",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Continuity, differentiation and integration in Euclidean n-space. Differentiable maps. Implicit and inverse function theorems. Differential forms and the general Stokes' theorem.",
        "spring":1,
        "fall":1
    },
    "MAT524":{
        "CourseTitle":"Abstract Algebra I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Groups and rings together with their homorphisms and quotient structures.  Unique factorization, polynomials, and fields.",
        "spring":1,
        "fall":1
    },
    "MAT525":{
        "CourseTitle":"Abstract Algebra II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A continuation of MAT 524, covering modules over rings (including the structure theorem for Modules over Principal Ideal Domains), theory of fields, field extensions, and an introduction to Galois theory.",
        "spring":1,
        "fall":1
    },
    "MAT526":{
        "CourseTitle":"Linear Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Finite dimensional vector spaces over a field, linear maps, isomorphisms, dual spaces, quotient vector spaces, bilinear and quadratic functions, inner products, canonical forms of linear operators, multilinear algebra, tensors.",
        "spring":1,
        "fall":1
    },
    "MAT529":{
        "CourseTitle":"Basic Topology and Geometry (for Masters Program)",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A broadly based introduction to topology and geometry, the mathematical theories of shape, form, and rigid structure. Topics include intuitive knot theory, lattices and tiling, non-Euclidean geometry, smooth curves and surfaces in Euclidean 3-space, open sets and continuity, combinatorial and algebraic invariants of spaces, higher dimensional spaces.\nThere will be a required short paper on the fundamental group of a topological space or some similar topic.\nFall, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring":1,
        "fall":1
    },
    "MAT530":{
        "CourseTitle":"Topology, Geometry I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Basic point set topology; connectedness, compactness, continuity, etc. Metric spaces, function spaces, and topological manifolds. Introduction to algebraic topology; fundamental group and covering space; homology; applications.\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT531":{
        "CourseTitle":"Topology, Geometry II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Foundations of differentiable manifolds: differentiable maps, vector fields and flows, and differential forms and integration on manifolds. Stokes' theorem. Froebenius theorem. Lie derivatives. Immersions and submersions. DeRham chomology, cochain complexes, degree of a map, Mayer-Vietoris Theorem.\nSpring,",
        "spring":1,
        "fall":1
    },
    "MAT532":{
        "CourseTitle":"Real Analysis I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Ordinary differential equations; Banach and Hilbert spaces; inverse and implicit function theorems; Lebesque measure; general measures and integrals; measurable functions; convergence theorems for integrals.\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT533":{
        "CourseTitle":"Real Analysis II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Representations and decomposition theorems in measure theory; Fubini's theorem;\nL-p spaces; Fourier series; Laplace; heat and wave equations; open mapping and uniform boundedness theorems for Banach spaces; differentiation of the integral; change of variable of integration.\n\nSpring",
        "spring":1,
        "fall":1
    },
    "MAT534":{
        "CourseTitle":"Algebra I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Groups: normal subgroups, quotient groups, Lagrange's theorem, class formula, finite p-groups and solvable groups, Sylow's theorems, finitely generated abelian groups. Rings and modules: subrings, fields, prime and maximal ideals, quotient rings, ID's, PID's, UFD's, polynomial rings, field of fractions, the Wedderburn theorem, Hilbert basis theorem, finitely generated modules over a PID. Vector spaces: basis, linear maps and matrices, dual spaces, determinants, eigenvalues and vectors, inner products, spectral theorem for normal operators.\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT535":{
        "CourseTitle":"Algebra II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Vector spaces: Cayley-Hamilton Theorem, Jordon normal form, bilinear forms, signature, tensor products, symmetric and exterior algebras. Homological algebra: categories and functors, universal and free objects, exact sequences, extensions. Representation theory for finite groups: irreducible representations and Shur's Lemma, characters, orthogonality. Galois theory: splitting fields, finite fields, extension fields of various types, Galois polynomial and group, fundamental theorem of Galois theory, symmetric functions.\nSpring,",
        "spring":1,
        "fall":1
    },
    "MAT536":{
        "CourseTitle":"Complex Analysis I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Elementary functions, holomorphic functions. Cauchy theory, power series, classification of isolated singularities, calculus of residues, open mapping theorem, Riemann mapping theorem.\nSpring,",
        "spring":1,
        "fall":1
    },
    "MAT537":{
        "CourseTitle":"Several Complex Variables",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Definition and basic properties of holomorphic functions and mappings. Analytic sets: Basic definitions, Local theory of Weierstrass, Meromorphic functions. Hartogs Phenomenon. Domains of convergence of power series. Domains of holomorphy. Pseudoconvexity and the Levi Problem. Complex manifolds, holomorphic vector bundles and Hermitian metrics. Cousin problems. L2 estimates for the inhomogeneous Cauchy-Riemann Equations and applications.",
        "spring":1,
        "fall":1
    },
    "MAT538":{
        "CourseTitle":"Riemann Surfaces",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Basic definitions and examples. Holomorphic differential forms. Riemann-Hurwitz Theorem. The Riemann-Roch Theroem. The Dirichlet Problem. The Hodge Theorem for Riemann surfaces. Embeddings into Projective Space. Uniformization theorem(s). Abel's Theorem and Jacobi's inversion theorem. Further topics may include: Sheaves and cohomology. Fields of meromorphic functions, valuations and connections with algebraic number theory. Monodromy and classification of branched covers.",
        "spring":1,
        "fall":1
    },
    "MAT540":{
        "CourseTitle":"Advanced Topology, Geometry I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Homotopy, fundamental group and higher homotopy groups, fiber bundles and covering, homotopy exact sequences of pairs, fiber bundles, classification of coverings, CW-complexes, homotopy excision, suspension, topological manifolds, topological classification of 1- and 2-manifolds.",
        "spring":1,
        "fall":1
    },
    "MAT541":{
        "CourseTitle":"Algebraic Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Singular and simplicial homology, their properties and equivalence, calculations for CW-complexes. Eilenberg-Steenrod axioms, cohomology, cup and cross products, Poincare, Lefschetz and Alexander dualities. Prerequisites: MAT 530, MAT 531, Fall",
        "spring":1,
        "fall":1
    },
    "MAT543":{
        "CourseTitle":"Representation Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"[will alternate with MAT 544]\nAn introduction to representation theory, with a focus on explicit examples. Representations of finite groups (in characteristic zero), especially symmetric and alternating groups. Representation theory of compact Lie groups and semisimple Lie algebras (which may also be covered in MAT 552). Representations of classical groups, esp. GL(n) and orthogonal groups. Schur-Weil duality for representations of S_n and GL(n), Young diagrams. Other possible topics include spin representations and Clifford algebras, representations of exceptional groups, applications to physics (e.g. hydrogen atom, spin, quarks), or an introduction to invariant theory.\nSample textbooks:\n- W. Fulton and J. Harris, Representation Theory: A First Course\n- A. Kirillov, Introduction to Lie Groups and Lie Algebras\n- T. Bröcker, Representations of compact Lie groups\n- P. Etingof et al, Introduction to representation theory\n(https:\/\/bookstore.ams.org\/stml-59\/)\n- G. Heckman, Lie Algebras in Mathematics and Physics\n(https:\/\/www.math.ru.nl\/~heckman\/Lie.pdf)\nPrerequisites: MAT 535.\nFall, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring":1,
        "fall":1
    },
    "MAT544":{
        "CourseTitle":"Commutative and Homological Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the techniques of commutative and homological algebra useful in algebra, algebraic geometry, number theory, and related fields. Review of rings and modules, tensor products and localization. Spectrum of prime ideals, Noetherian and Artinian rings and modules, completion, dimension theory, local rings, discrete valuation rings and Dedekind domains, integral dependence. Chain complexes, projective and injective resolutions, examples of derived functors (Ext and Tor), basic category theory (adjoint functors, natural transformations, limits and colimits), abelian categories.\nPrerequisite: MAT 535\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT545":{
        "CourseTitle":"Complex Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":[
            [
                "MAT530",
                "MAT534",
                "MAT542"
            ]
        ],
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Foundational material and techniques in complex algebraic and differential geometry: Review of basic results in several complex variables\/analytic geometry, sheaves and cohomology of sheaves, complex vector bundles, Chern classes, positivity, Kaehler manifolds, projective manifolds,  Hodge decomposition for Kaehler manifolds, Kodaira vanishing theorem, Hard Lefschetz Theorem, divisors and line bundles, Bertini's theorem, Lefschetz theorem on (1,1) classes, blowing up, Kodaira's embedding theorem.\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT550":{
        "CourseTitle":"Introduction to Probability",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"[will alternate with MAT 551]\nIntroduction to probability theory: independence, laws of large numbers, central limit theorems, martingales, Markov chains, and a selection of other topics such as ergodic theory, Brownian motion, random walks on graphs and groups, percolation, mixing times, randomized algorithms.",
        "spring":1,
        "fall":1
    },
    "MAT551":{
        "CourseTitle":"Introduction to PDE",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Introduction to basic types of partial differential equations and techniques for studying them. First order equations; The Cauchy problem and the Cauchy-Kovalevskaya Theorem; Laplace, heat, and wave operators; Sobolev and Holder spaces; second order linear elliptic equations: weak solutions, existence and regularity theory; L^p and Schauder estimates; de Giorgi-Nash-Moser theory; introduction to nonlinear equations\"\nPrerequisite:  MAT 531, MAT 536\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT552":{
        "CourseTitle":"Introduction to Lie Groups and Lie Algebras",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to Lie groups and Lie algebras, as used in mathematics and physics. Basic facts about Lie groups and Lie algebras; classical groups. Structure theory of Lie algebras. Representation theory of sl (2,C). Classification of complex semisimple Lie algebras via their root systems. Examples of exceptional Lie algebras. Other possible topics include the representation theory compact Lie groups and semisimple Lie algebras (with a focus on analytic techniques).",
        "spring":1,
        "fall":1
    },
    "MAT554":{
        "CourseTitle":"Harmonic Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An introduction to the methods and ideas of modern harmonic analysis, including: Fourier series and integrals (convergence, summability, L^p); Maximal functions, weak type inequalities, interpolation; the Hilbert transform; singular integrals with Calderon-Zygmund kernels; H^1 and Bounded Mean Oscillation; Muckenhoupt (A_p) weights; Multipliers; the T(1) theorem. Offered every second year.",
        "spring":1,
        "fall":1
    },
    "MAT555":{
        "CourseTitle":"Ergodic Theory and Smooth Dynamics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course will give an overview of the main known topological, geometrical, and measure theoretical phenomena of smooth dynamics:\n1) Zero entropy of dynamics: Circle diffeomorphisms, KAM, period doubling, renormalization.\n2)Hyperbolic dynamics: stable manifold theorem, structural stability, central limit theorem, symbolic dynamics.\n3)General smooth ergodic theory: Oseledec, Pesin, Birkhof theorems.\n4)Non-hyperbolic examples: non-uniform hyperbolic examples, homoclinic theory, Newhouse phenomenon, aspects of unimodal dynamics, aspects of Henon dynamics.\nPrerequisites: MAT 531, MAT 533, MAT 536\n3 credits. Offered in Spring.",
        "spring":1,
        "fall":1
    },
    "MAT556":{
        "CourseTitle":"One-dimensional Real and Complex Dynamics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Advanced material and techniques in one-dimensional dynamics. In real one-dimensional dynamics: circle diffeomorphisms, combinatorics and kneading theory, wandering intervals, ergodic properties and invariant measures, renormalization. For complex one-dimensional maps: Julia, Fatou sets, the Mandelbrot set, fixed point theory, external rays, quadratic-like maps and little Mandelbrot copies.",
        "spring":1,
        "fall":1
    },
    "MAT560":{
        "CourseTitle":"Mathematical Physics I",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Classical mechanics: Lagrangian and Hamiltonian formalism, Hamiltonian group actions. Special relativity and Lorentz and Poincare groups. Classical field theories: Lagrangian and Hamiltonian formulation, Noether theorem, examples. Relativistic theories. Gauge theories: electrodynamics and Yang-Mills theories. General relativity: Einstein-Hilbert action, Einstein equations and Schwarzchild solution. Optional topics may include: Chern-Simons and topological field theories; Classical theory of spinor fields and supergeometry.",
        "spring":1,
        "fall":1
    },
    "MAT561":{
        "CourseTitle":"Mathematical Physics II",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Quantum mechanics: Heisenberg and Schrodinger formalism, examples. Feynman path integral. Quantum field theory: Canonical quantization, Fock space and creation\/annihilation operators. Relativistic particles and unitary representations of the Poincare group. Path integral formalism for fields. Quantization of gauge fields, gauge fixing. Optional topics may include: Dirac equation and spinors, integration over anticommuting variables. Supersymmetric quantum field theories. Topological quantum field theories and other examples, localization.",
        "spring":1,
        "fall":1
    },
    "MAT562":{
        "CourseTitle":"Symplectic Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Hamilton's equations and their physical origin, symplectic manifolds and various submanifolds; Moser arguments including Darboux theorem and Moser neighborhood theorems, contact manifolds, contact hypersurfaces, symplectizations, Legendrian front diagrams, topological Legendrian knot invariants, almost complex structures compatible with symplectic form, Hamiltonian group actions and symplectic reduction, symplectic toric manifolds, h principle with emphasis on holonomic approximation theorem along with applications to symplectic and contact geometry , Gromov non squeezing theorem and a summary of pseudoholomorphic curve theory.\nPrerequisite: MAT 531",
        "spring":1,
        "fall":1
    },
    "MAT566":{
        "CourseTitle":"Differential Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Vector bundles, transversality, and characteristic classes. Further topics such as imbeddings and immersions, intersection theory, surgery, and foliations.\nPrerequisite: MAT 531\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT568":{
        "CourseTitle":"Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Connections, curvature, geodesics, parallelism, and completeness. Riemannian manifolds, geometry of sub-manifolds; method of integral formulas; applications to global extrinsic theorems. Riemannian curvature. Gauss-Bonnet theorem, Hopf-Rinow theorem.\nPrerequisite: MAT 531\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT569":{
        "CourseTitle":"Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"A broad introduction to the fundamentals of modern Riemannian geometry, including major ideas and useful techniques: holonomy groups, symmetric spaces; Riemannian submersions; constructing manifolds of non-negative sectional curvature; Ricci and scalar curvature; Weyl curvature and conformal geometry; harmonic forms and the Hodge theorem; the Bochner technique; the Bishop-Gromov inequality; the Cheeger-Gromoll splitting theorem; Gromov-Hausdorff convergence.\nPrerequisite: MAT 568\nSpring,",
        "spring":1,
        "fall":1
    },
    "MAT589":{
        "CourseTitle":"Introduction to Algebraic Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"This course offers a systematic introduction to algebraic geometry, from a modern, scheme-theoretic perspective.",
        "spring":1,
        "fall":1
    },
    "MAT598":{
        "CourseTitle":"Teaching Practicum",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Seminar and workshop for new teaching assistants.\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT599":{
        "CourseTitle":"M.A. Research",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"",
        "spring":1,
        "fall":1
    },
    "MAT602":{
        "CourseTitle":"Topics in Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from group theory, ring theory, representation theory of groups and algebras, fields and commutative algebra, homological algebra.\nPrerequisite: Permission of instructor\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT603":{
        "CourseTitle":"Topics in Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from group theory, ring theory, representation theory of groups and algebras, fields and commutative algebra, homological algebra.\nPrerequisite: Permission of instructor\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT608":{
        "CourseTitle":"Topics in Number Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from analytic number theory, algebraic number theory, diophantine equations, and transcendental number theory, with indications of methods from algebra, geometry, analysis, and logic.\nPrerequisite: Permission of instructor\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT609":{
        "CourseTitle":"Topics in Number Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from analytic number theory, algebraic number theory, diophantine equations, and transcendental number theory, with indications of methods from algebra, geometry, analysis, and logic.\nPrerequisite: Permission of instructor\nFall,",
        "spring":1,
        "fall":1
    },
    "MAT614":{
        "CourseTitle":"Topics in Algebraic Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from varieties and schemes, algebraic curves, and their arithmetics. Fall\nPrerequisite: Permission of instructor",
        "spring":1,
        "fall":1
    },
    "MAT615":{
        "CourseTitle":"Topics in Algebraic Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from varieties and schemes, algebraic curves, and their arithmetics. Fall\nPrerequisite: Permission of instructor",
        "spring":1,
        "fall":1
    },
    "MAT620":{
        "CourseTitle":"Topics in Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics of current interest such as foliations, surgery, singularities, group actions on manifolds, and homotopy theory.\nPrerequisite: Permission of instructor\nMAT 620 - Fall, MAT 621 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT621":{
        "CourseTitle":"Topics in Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics of current interest such as foliations, surgery, singularities, group actions on manifolds, and homotopy theory.\nPrerequisite: Permission of instructor\nMAT 620 - Fall, MAT 621 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT626":{
        "CourseTitle":"Topics in Complex Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics selected from Riemann surfaces, quasiconformal mappings, several complex variables, Fuchsian groups, Kleinian groups, moduli of Riemann surfaces and Kleinian groups, analytic spaces, singularities.\nPrerequisite: Permission of instructor\nMAT 626 - Fall, MAT 627 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT627":{
        "CourseTitle":"Topics in Complex Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics selected from Riemann surfaces, quasiconformal mappings, several complex variables, Fuchsian groups, Kleinian groups, moduli of Riemann surfaces and Kleinian groups, analytic spaces, singularities.\nPrerequisite: Permission of instructor\nMAT 626 - Fall, MAT 627 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT632":{
        "CourseTitle":"Topics in Differential Equations",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are hyperbolic or elliptic systems, parabolic equations, spectral theory, finite difference equations, Cauchy-Riemann equations and complex vector fields, equations with constant coefficients, solvability of linear equations, Fourier integral operators, nonlinear equations.\nPrerequisite: Permission of instructor\nMAT 632 - Fall, MAT 633 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT633":{
        "CourseTitle":"Topics in Differential Equations",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are hyperbolic or elliptic systems, parabolic equations, spectral theory, finite difference equations, Cauchy-Riemann equations and complex vector fields, equations with constant coefficients, solvability of linear equations, Fourier integral operators, nonlinear equations.\nPrerequisite: Permission of instructor\nMAT 632 - Fall, MAT 633 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT638":{
        "CourseTitle":"Topics in Real Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics selected from functional analysis, harmonic analysis, Banach algebras, operator theory.\nPrerequisite: Permission of instructor\nMAT 638 - Fall, MAT 639 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT639":{
        "CourseTitle":"Topics in Real Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Topics selected from functional analysis, harmonic analysis, Banach algebras, operator theory.\nPrerequisite: Permission of instructor\nMAT 638 - Fall, MAT 639 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT641":{
        "CourseTitle":"Topics in Lie Groups Theory",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are universal enveloping algebras; free, solvable and nilpotent Lie algebras; Lie theory and formal groups; root systems, Dynkin diagrams, classification and representations of complex semisimple Lie algebras; method of orbits; representations of non-compact Lie groups; loop groups.\nPrerequisite: MAT 552\nSpring,",
        "spring":1,
        "fall":1
    },
    "MAT644":{
        "CourseTitle":"Topics in Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics will be drawn from areas such as comparison theorems, pinching theorems, Morse theory, characteristic classes, minimal varieties, Hodge theory, spectrum of the Laplacian, and geometry of general relativity.\nPrerequisite: Permission of instructor\nMAT 644 - Fall, MAT 645 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT645":{
        "CourseTitle":"Topics in Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics will be drawn from areas such as comparison theorems, pinching theorems, Morse theory, characteristic classes, minimal varieties, Hodge theory, spectrum of the Laplacian, and geometry of general relativity.\nPrerequisite: Permission of instructor\nMAT 644 - Fall, MAT 645 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT648":{
        "CourseTitle":"Topics in Mathematical Physics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are mathematical methods of classical and quantum mechanics; methods of functional integration and its applications; infinite-dimensional Lie algebras, quantum groups and representations; conformal field theories; super-symmetry; topological quantum field theories; gauge theories and geometry in four-dimensions; supergravity and mirror symmetry; strings.\nPrerequisite: Permission of instructor\nMAT 648 - Fall, MAT 649 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT649":{
        "CourseTitle":"Topics in Mathematical Physics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are mathematical methods of classical and quantum mechanics; methods of functional integration and its applications; infinite-dimensional Lie algebras, quantum groups and representations; conformal field theories; super-symmetry; topological quantum field theories; gauge theories and geometry in four-dimensions; supergravity and mirror symmetry; strings.\nPrerequisite: Permission of instructor\nMAT 648 - Fall, MAT 649 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT655":{
        "CourseTitle":"Topics in Dynamical Systems",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from holomorphic and low-dimensional dynamics, hyperbolic dynamics, theory of Hamiltonian systems, ergodic theory, and bifurcation theory.\nPrerequisite: Permission of instructor\nMAT 655 - Fall, MAT 656 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT656":{
        "CourseTitle":"Topics in Dynamical Systems",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Typical topics are drawn from holomorphic and low-dimensional dynamics, hyperbolic dynamics, theory of Hamiltonian systems, ergodic theory, and bifurcation theory.\nPrerequisite: Permission of instructor\nMAT 655 - Fall, MAT 656 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT662":{
        "CourseTitle":"Advanced Topics in Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 662 - Fall, MAT 663 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT663":{
        "CourseTitle":"Advanced Topics in Algebra",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 662 - Fall, MAT 663 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT666":{
        "CourseTitle":"Advanced Topics in Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 666 - Fall, MAT 667 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT667":{
        "CourseTitle":"Advanced Topics in Topology",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 666 - Fall, MAT 667 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT670":{
        "CourseTitle":"Advanced Topics in Complex Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 670 - Fall, MAT 671 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT671":{
        "CourseTitle":"Advanced Topics in Complex Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 670 - Fall, MAT 671 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT674":{
        "CourseTitle":"Advanced Topics in Differential Equations",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 674 - Fall, MAT 675 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT675":{
        "CourseTitle":"Advanced Topics in Differential Equations",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 674 - Fall, MAT 675 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT678":{
        "CourseTitle":"Advanced Topics in Real Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 678 - Fall, MAT 679 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT679":{
        "CourseTitle":"Advanced Topics in Real Analysis",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 678 - Fall, MAT 679 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT682":{
        "CourseTitle":"Advanced Topics in Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 682 - Fall, MAT 683 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT683":{
        "CourseTitle":"Advanced Topics in Differential Geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Permission of instructor\nMAT 682 - Fall, MAT 683 - Spring,",
        "spring":1,
        "fall":1
    },
    "MAT685":{
        "CourseTitle":"Advanced Topics in Dynamics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An advanced topic selected from holomorphic and low-dimensional dynamics, hyperbolic dynamics, KAM theory, smooth ergodic theory, geodesic flows, bifurcation theory.\nPrerequisite: Permission of instructor\nMAT 685 - Fall, MAT 686 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT686":{
        "CourseTitle":"Advanced Topics in Dynamics",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"An advanced topic selected from holomorphic and low-dimensional dynamics, hyperbolic dynamics, KAM theory, smooth ergodic theory, geodesic flows, bifurcation theory.\nPrerequisite: Permission of instructor\nMAT 685 - Fall, MAT 686 - Spring, 3 credits, ABCF grading",
        "spring":1,
        "fall":1
    },
    "MAT690":{
        "CourseTitle":"Advanced topics in algebraic geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Fall, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring":1,
        "fall":1
    },
    "MAT691":{
        "CourseTitle":"Advanced topics in algebraic geometry",
        "Career":"Graduate",
        "Credits":3.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Spring, 3 credits, Letter graded (A, A-, B+, etc.)",
        "spring":1,
        "fall":1
    },
    "MAT696":{
        "CourseTitle":"Mathematics Seminar",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"",
        "spring":1,
        "fall":1
    },
    "MAT697":{
        "CourseTitle":"Mathematics Colloquium",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"",
        "spring":1,
        "fall":1
    },
    "MAT698":{
        "CourseTitle":"Independent Study",
        "Career":"Graduate",
        "Credits":"1.00 - 12.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"",
        "spring":1,
        "fall":1
    },
    "MAT699":{
        "CourseTitle":"Dissertation Research on Campus",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Dissertation research under direction of advisor.\nPrerequisite: Advancement to candidacy (G5). Major portion of research must take place on SBU campus, at Cold Spring Harbor, or at the Brookhaven National Lab.\nFall, Spring, and Summer,",
        "spring":1,
        "fall":1
    },
    "MAT700":{
        "CourseTitle":"Dissertation Research off Campus - Domestic",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Must be advanced to candidacy (G5). Major portion of research will take place off-campus, but in the United States and\/or U.S. provinces. Please note, Brookhaven National Labs and the Cold Spring Harbor Lab are considered on-campus.\nAll international students must enroll in one of the graduate student insurance plans and should be advised by an International Advisor.\nFall, Spring, Summer",
        "spring":1,
        "fall":1
    },
    "MAT701":{
        "CourseTitle":"Dissertation Research off Campus - International",
        "Career":"Graduate",
        "Credits":"1.00 - 9.00",
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"Prerequisite: Must be advanced to candidacy (G5). Major portion of research will take place outside of the United States and\/or U.S. provinces.\nDomestic students have the option of the health plan and may also enroll in MEDEX.\nInternational students who are in their home country are not covered by mandatory health plan and must contact the Insurance Office for the insurance charge to be removed.\nInternational students who are not in their home country are charged for the mandatory health insurance. If they are to be covered by another insurance plan they must file a waiver be second week of classes. The charge will only be removed if other plan is deemed comparable.\nAll international students must received clearance from an International Advisor.\nFall, Spring, Summer",
        "spring":1,
        "fall":1
    },
    "MAT800":{
        "CourseTitle":"FULL TIME SUMMER RES",
        "Career":"Graduate",
        "Credits":0.0,
        "Prerequisites":"NONE",
        "Antirequisites":"NONE",
        "Corequisites":"NONE",
        "Description":"",
        "spring":1,
        "fall":1
    }
}